Repository: dotnet/cli
Catalog: src/dotnet/commands/dotnet-tool/list/xlf/LocalizableStrings.*.xlf
Languages: es

# CommandDescription
source: List tools installed globally or locally.
es: Enumerar herramientas instaladas a nivel global o local.

# GlobalOptionDescription
source: List tools installed for the current user.
es: Lista de herramientas instaladas para el usuario actual.

# ListToolCommandInvalidGlobalAndLocalAndToolPath
source: The local option(--local), the global option (--global), the tool path option (--tool-path), can only have one at a time. Please specify only one of the options: {0}.
es: La opción local (--local), la opción global (--global) y la opción de ruta de acceso de la herramienta (--tool-path) pueden darse solo de una en una. Especifique solo una de las opciones: {0}.

# LocalOptionDescription
source: List the tools installed in the local tool manifest.
es: Lista de las herramientas instaladas en el manifiesto de la herramienta local.

# VersionColumn
source: Version
es: Versión

# CommandsColumn
source: Commands
es: Comandos

# PackageIdColumn
source: Package Id
es: Id. de paquete

# InvalidPackageWarning
source: Warning: tool package '{0}' is invalid, please contact tool author: {1}
es: ADVERTENCIA: El paquete de la herramienta "{0}" no es válido, póngase en contacto con el autor de la herramienta: {1}

# InvalidToolPathOption
source: Tool path '{0}' does not exist.
es: La ruta de acceso de la herramienta "{0}" no existe.

# ToolPathOptionDescription
source: The directory containing the tools to list.
es: El directorio que contiene las herramientas que se van a enumerar.
