Repository: dotnet/cli
Catalog: src/dotnet/commands/dotnet-list/dotnet-list-package/xlf/LocalizableStrings.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# AppFullName
source: List all package references of the project or solution.
cs: Vypíše všechny odkazy na balíčky z projektu nebo řešení.
de: Hiermit listen Sie alle Paketverweise des Projekts oder der Lösung auf.
es: Enumere todas las referencias de paquete del proyecto o la solución.
fr: Listez toutes les références de package du projet ou de la solution.
it: Elenca tutti i riferimenti al pacchetto del progetto o della soluzione.
ja: プロジェクトまたはソリューションのすべてのパッケージ参照を一覧表示します。
ko: 프로젝트 또는 솔루션의 모든 패키지 참조를 나열합니다.
pl: Zwróć listę wszystkich odwołań do pakietów w projekcie lub rozwiązaniu.
pt_br: Listar todas as referências de pacote do projeto ou da solução.
ru: Вывод списка всех ссылок на пакеты для проекта или решения.
tr: Proje veya çözümdeki tüm paket başvurularını listeleyin.
zh_hans: 列出项目或解决方案的所有包引用。
zh_hant: 列出專案或解決方案的所有套件參考。

# CmdDeprecatedDescription
source: Lists packages that have been deprecated.
cs: Seznam zastaralých balíčků
de: Listet Pakete auf, die veraltet sind.
es: Muestra los paquetes que han quedado en desuso.
fr: Liste les packages qui ont été dépréciés.
it: Elenca i pacchetti che sono stati deprecati.
ja: 非推奨となったパッケージを一覧表示します。
ko: 사용되지 않는 패키지를 나열합니다.
pl: Wyświetla pakiety, które są przestarzałe.
pt_br: Lista pacotes que foram preteridos.
ru: Список нерекомендуемых пакетов.
tr: Kullanım dışı bırakılan paketleri listeler.
zh_hans: 列出已弃用的包。
zh_hant: 列出已取代的套件。

# CmdFramework
source: FRAMEWORK | FRAMEWORK\RID
cs: ARCHITEKTURA | ARCHITEKTURA\RID
es: MARCO | FRAMEWORK\RID
ja: フレームワーク | フレームワーク\RID
ko: 프레임워크 | FRAMEWORK\RID
pl: STRUKTURA | STRUKTURA\RID
pt_br: ESTRUTURA | ESTRUTURA\RID
tr: ÇERÇEVE | FRAMEWORK\RID
zh_hans: 框架 | FRAMEWORK\RID

# CmdFrameworkDescription
source: Chooses a framework to show its packages. Use the option multiple times for multiple frameworks.
cs: Zvolí architekturu, pro kterou se mají zobrazit balíčky. Pokud chcete určit více architektur, zadejte tento přepínač vícekrát.
de: Wählt ein Framework für die Anzeige der zugehörigen Pakete aus. Für mehrere Frameworks verwenden Sie die Option mehrmals.
es: Elige un marco para mostrar sus paquetes. Utilice la opción varias veces para marcos múltiples.
fr: Choisit un framework pour afficher ses packages. Utilisez l'option plusieurs fois selon le nombre de frameworks.
it: Consente di scegliere un framework per mostrarne i pacchetti. Usare l'opzione più volte in caso di framework multipli.
ja: パッケージを表示するフレームワークを選択します。複数のフレームワークに対してはこのオプションを複数回使用します。
ko: 프레임워크를 선택하여 패키지를 표시합니다. 여러 프레임워크의 경우 옵션을 여러 번 사용합니다.
pl: Wybiera strukturę, aby wyświetlić jej pakiety. W przypadku wielu struktur użyj tej opcji wielokrotnie.
pt_br: Escolhe uma estrutura para mostrar seus pacotes. Use a opção várias vezes para várias estruturas.
ru: Выбирает платформу, список пакетов для которой необходимо отобразить. Для нескольких платформ укажите этот параметр несколько раз.
tr: Paketlerini görüntülemek için bir çerçeve seçin. Birden fazla çerçeve için seçeneği birden fazla kez kullanın.
zh_hans: 选择一个框架来显示其包。对多个框架多次使用该选项。
zh_hant: 選擇架構以顯示其套件。若有多個架構，則重複使用該選項。

# CmdOutdatedDescription
source: Lists packages that have newer versions.
cs: Zobrazí seznam balíčků, které mají novější verze.
de: Listet Pakete mit neueren Versionen auf.
es: Muestra los paquetes que tienen versiones más recientes.
fr: Liste les packages avec des versions plus récentes.
it: Elenca i pacchetti per cui esistono versioni più recenti.
ja: 新しいバージョンが含まれるパッケージを一覧表示します。
ko: 최신 버전이 있는 패키지를 나열합니다.
pl: Zwraca listę pakietów, które mają nowsze wersje.
pt_br: Lista os pacotes que têm as versões mais recentes.
ru: Список пакетов, для которых обнаружены более новые версии.
tr: Daha yeni sürümleri olan paketleri listeler.
zh_hans: 列出具有较新版本的包。
zh_hant: 列出有較新版本的套件。

# CmdTransitiveDescription
source: Lists transitive and top-level packages.
cs: Vypíše seznam přenosných balíčků a balíčků nejvyšší úrovně.
de: Listet transitive Pakete und Pakete der obersten Ebene auf.
es: Contiene paquetes de transitivos y de nivel superior.
fr: Liste les packages transitifs et de niveau supérieur.
it: Elenca i pacchetti transitivi e di primo livello.
ja: 推移的なパッケージと最上位レベルのパッケージを一覧表示します。
ko: 전이적 패키지 및 최상위 패키지를 나열합니다.
pl: Zwraca listę pakietów przejściowych i pakietów najwyższego poziomu.
pt_br: Lista os pacotes de nível superior e transitivos.
ru: Список транзитивных пакетов и пакетов верхнего уровня.
tr: Geçişli ve üst düzey paketleri listeler.
zh_hans: 列出可传递的包和顶级包。
zh_hant: 列出可轉移和頂層套件。

# NoProjectsOrSolutions
source: A project or solution file could not be found in {0}. Specify a project or solution file to use.
cs: {0} neobsahuje žádný soubor projektu nebo řešení. Zadejte soubor projektu nebo řešení, který chcete použít.
de: In "{0}" wurde keine Projekt- oder Projektmappendatei gefunden. Geben Sie eine Projekt- oder Projektmappendatei an, die Sie verwenden möchten.
es: No se encontró un archivo de proyecto o solución en {0}. Especifique un archivo de proyecto o solución para utilizar.
fr: Fichier projet ou solution introuvable dans {0}. Spécifiez un fichier projet ou solution à utiliser.
it: Non è stato possibile trovare un file di progetto o di soluzione in {0}. Specificare un file di progetto o di soluzione da usare.
ja: {0} でプロジェクトまたはソリューション ファイルが見つかりませんでした。使用するプロジェクトまたはソリューション ファイルを指定します。
ko: {0}에서 프로젝트 또는 솔루션 파일을 찾을 수 없습니다. 사용할 프로젝트 또는 솔루션 파일을 지정하세요.
pl: W lokalizacji {0} nie można odnaleźć pliku projektu lub rozwiązania. Podaj plik projektu lub rozwiązania do użycia.
pt_br: Um arquivo de projeto ou de solução não pôde ser encontrado em {0}. Especifique um arquivo de projeto ou de solução a ser usado.
ru: Не удалось найти файл проекта или решения в {0}. Укажите используемый файл проекта или решения.
tr: {0} içinde bir proje veya çözüm dosyası bulunamadı. Kullanmak için bir proje veya çözüm dosyası belirtin.
zh_hans: 在 {0} 中找不到项目或解决方案文件。指定要使用的项目或解决方案文件。
zh_hant: 在 {0} 中找不到專案或解決方案檔案。請指定要使用的專案或解決方案檔案。

# CmdConfig
source: CONFIG_FILE
cs: KONFIG_SOUBOR
it: FILE_CONFIG
pl: PLIK_KONFIGURACJI

# CmdConfigDescription
source: The path to the NuGet config file to use. Requires the '--outdated' or '--deprecated' option.
cs: Cesta ke konfiguračnímu souboru NuGet, který se má použít. Vyžaduje přepínač --outdated nebo --deprecated.
de: Der Pfad zu der NuGet-Konfigurationsdatei, die verwendet werden soll. Erfordert die Option "--outdated" oder "--deprecated".
es: La ruta al archivo de config de NuGet que se usará. Se requiere la opción "--outdated" o "--deprecated".
fr: Chemin du fichier config NuGet à utiliser. Nécessite l'option '--outdated' ou '--deprecated'.
it: Percorso del file config NuGet da usare. Richiede l'opzione '--outdated' o '--deprecated'.
ja: 使用する NuGet config ファイルのパス。'--outdated' または '--deprecated' のオプションが必要です。
ko: 사용할 NuGet 구성 파일의 경로입니다. '--outdated' 또는 '--deprecated' 옵션이 필요합니다.
pl: Ścieżka do pliku konfiguracji NuGet, który ma być używany. Wymaga opcji „--outdated” lub „--deprecated”.
pt_br: O caminho para o arquivo de configuração do NuGet a ser usado. Exige a opção '--outdated' ou '--deprecated'.
ru: Путь к используемому файлу конфигурации NuGet. Требуется указать параметр "--outdated" или "--deprecated".
tr: Kullanılacak NuGet yapılandırma dosyasının yolu. '--outdated' veya '--deprecated' seçeneğini gerektirir.
zh_hans: 要使用的 NuGet 配置文件的路径。需要 "--outdated" 或 "--deprecated" 选项。
zh_hant: 要使用的 NuGet 組態檔路徑。需要使用 '--outdated’ 或 '--deprecated' 選項。

# CmdHighestMinorDescription
source: Consider only the packages with a matching major version number when searching for newer packages. Requires the '--outdated' or '--deprecated' option.
cs: Při hledání novějších balíčků se budou brát v úvahu jen balíčky s odpovídajícím číslem hlavní verze. Vyžaduje přepínač --outdated nebo --deprecated.
de: Hiermit werden bei der Suche nach neueren Paketen nur Pakete mit übereinstimmender Hauptversionsnummer berücksichtigt. Erfordert die Option "--outdated" oder "--deprecated".
es: Al buscar paquetes más recientes, tenga en cuenta solo los paquetes con números de versión principal que coincidan. Se requiere la opción "--outdated" o "--deprecated".
fr: Prend en compte uniquement les packages avec le numéro de version principale correspondant durant la recherche de packages plus récents. Nécessite l'option '--outdated' ou '--deprecated'.
it: Prende in considerazione solo i pacchetti con il numero di versione principale corrispondente quando si cercano i pacchetti più recenti. Richiede l'opzione '--outdated' o '--deprecated'.
ja: 新しいパッケージを検索するときにメジャー バージョン番号が一致するパッケージのみを検討します。'--outdated' または '--deprecated' のオプションが必要です。
ko: 최신 패키지를 검색할 때 주 버전 번호가 일치하는 패키지만 고려합니다. '--outdated' 또는 '--deprecated' 옵션이 필요합니다.
pl: Podczas wyszukiwania nowszych pakietów uwzględniaj tylko pakiety ze zgodnym numerem wersji głównej. Wymaga opcji „--outdated” lub „--deprecated”.
pt_br: Ao procurar pacotes mais novos, considere apenas os pacotes com número de versão principal correspondente. Exige a opção '--outdated' ou '--deprecated'.
ru: Учитывать только пакеты с соответствующим основным номером версии при поиске более новых версий пакетов. Требуется указать параметр "--outdated" или "--deprecated".
tr: Daha yeni paketler aranırken yalnızca eşleşen birincil sürüm numarasına sahip paketleri göz önünde bulundurun. '--outdated' veya '--deprecated' seçeneğini gerektirir.
zh_hans: 在搜索较新的包时，仅考虑具有匹配的主版本号的包。需要 "--outdated" 或 "--deprecated" 选项。
zh_hant: 在搜尋較新的套件時，建議只搜尋主要版本號碼相符的套件。需要使用 '--outdated' 或 '--deprecated' 選項。

# CmdHighestPatchDescription
source: Consider only the packages with a matching major and minor version numbers when searching for newer packages. Requires the '--outdated' or '--deprecated' option.
cs: Při hledání novějších balíčků se budou brát v úvahu jen balíčky s odpovídajícími čísly hlavní verze a podverze. Vyžaduje přepínač --outdated nebo --deprecated.
de: Hiermit werden bei der Suche nach neueren Paketen nur Pakete mit übereinstimmender Haupt- und Nebenversionsnummer berücksichtigt. Erfordert die Option "--outdated" oder "--deprecated".
es: Al buscar paquetes más recientes, tenga en cuenta solo los paquetes con números de versión principal y secundaria que coincidan. Se requiere la opción "--outdated" o "--deprecated".
fr: Prend en compte uniquement les packages avec les numéros de version principale et mineure correspondants durant la recherche de packages plus récents. Nécessite l'option '--outdated' ou '--deprecated'.
it: Prende in considerazione solo i pacchetti con i numeri di versione principale e secondaria corrispondenti quando si cercano i pacchetti più recenti. Richiede l'opzione '--outdated' o '--deprecated'.
ja: 新しいパッケージを検索するときにメジャーとマイナーのバージョン番号が一致するパッケージのみを検討します。'--outdated' または '--deprecated' のオプションが必要です。
ko: 최신 패키지를 검색할 때 주 버전 번호와 부 버전 번호가 일치하는 패키지만 고려합니다. '--outdated' 또는 '--deprecated' 옵션이 필요합니다.
pl: Podczas wyszukiwania nowszych pakietów uwzględniaj tylko pakiety ze zgodnym numerem wersji głównej i pomocniczej. Wymaga opcji „--outdated” lub „--deprecated”.
pt_br: Ao procurar pacotes mais novos, considere apenas os pacotes com números de versão principal e secundária correspondentes. Exige a opção '--outdated' ou '--deprecated'.
ru: Учитывать только пакеты с соответствующими основным и дополнительным номерами версий при поиске более новых версий пакетов. Требуется указать параметр "--outdated" или "--deprecated".
tr: Daha yeni paketler aranırken yalnızca eşleşen birincil ve ikincil sürüm numaralarına sahip paketleri değerlendirin. '--outdated' veya '--deprecated' seçeneğini gerektirir.
zh_hans: 在搜索较新的包时，仅考虑具有匹配的主要和次要版本号的包。需要 "--outdated" 或 "--deprecated" 选项。
zh_hant: 在搜尋較新的套件時，建議只搜尋主要和次要版本號碼相符的套件。需要使用 '--outdated’ 或 '--deprecated' 選項。

# CmdPrereleaseDescription
source: Consider packages with prerelease versions when searching for newer packages. Requires the '--outdated' or '--deprecated' option.
cs: Při hledání novějších balíčků se budou brát v úvahu i balíčky v předběžných verzích. Vyžaduje přepínač --outdated nebo --deprecated.
de: Hiermit werden bei der Suche nach neueren Paketen auch Pakete mit Vorabversionen berücksichtigt. Erfordert die Option "--outdated" oder "--deprecated".
es: Al buscar paquetes más recientes, tenga en cuenta los paquetes con versiones previas. Se requiere la opción "--outdated" o "--deprecated".
fr: Prend en compte les packages avec des préversions durant la recherche de packages plus récents. Nécessite l'option '--outdated' ou '--deprecated'.
it: Prende in considerazione i pacchetti con versioni preliminari quando si cercano i pacchetti più recenti. Richiede l'opzione '--outdated' o '--deprecated'.
ja: 新しいパッケージを検索するときにプレリリース バージョンのパッケージを検討します。'--outdated' または '--deprecated' のオプションが必要です。
ko: 최신 패키지를 검색할 때 시험판 버전이 있는 패키지를 고려합니다. '--outdated' 또는 '--deprecated' 옵션이 필요합니다.
pl: Podczas wyszukiwania nowszych pakietów uwzględniaj pakiety z wersjami wstępnymi. Wymaga opcji „--outdated” lub „--deprecated”.
pt_br: Ao procurar pacotes mais novos, considere pacotes com versões de pré-lançamento. Exige a opção '--outdated' ou '--deprecated'.
ru: Учитывать пакеты с версиями предварительных выпусков при поиске более новых версий пакетов. Требуется указать параметр "--outdated" или "--deprecated".
tr: Daha yeni paketleri ararken yayın öncesi sürümlere sahip olan paketleri göz önünde bulundurun. '--outdated' veya '--deprecated' seçeneğini gerektirir.
zh_hans: 在搜索较新的包时，请考虑使用具有预发行版本的包。需要 "--outdated" 或 "--deprecated" 选项。
zh_hant: 在搜尋較新的套件時，建議搜尋具有發行前版本的套件。需要使用 '--outdated' 或 '--deprecated' 選項。

# CmdSource
source: SOURCE
es: ORIGEN
it: ORIGINE
pl: ŹRÓDŁO
pt_br: ORIGEM

# CmdSourceDescription
source: The NuGet sources to use when searching for newer packages. Requires the '--outdated' or '--deprecated' option.
cs: Zdroje NuGet, které se mají použít při hledání novějších balíčků. Vyžaduje přepínač --outdated nebo --deprecated.
de: Die bei der Suche nach neueren Paketen zu verwendenden NuGet-Quellen. Erfordert die Option "--outdated" oder "--deprecated".
es: Los orígenes de NuGet que se usan al buscar paquetes más recientes. Se requiere la opción "--outdated" o "--deprecated".
fr: Sources NuGet à utiliser durant la recherche de packages plus récents. Nécessite l'option '--outdated' ou '--deprecated'.
it: Origini NuGet da usare quando si cercano i pacchetti più recenti. Richiede l'opzione '--outdated' o '--deprecated'.
ja: 新しいパッケージを検索するときに使用する NuGet ソース。'--outdated' または '--deprecated' オプションが必要です。
ko: 최신 패키지를 검색할 때 사용하는 NuGet 소스입니다. '--outdated' 또는 '--deprecated' 옵션이 필요합니다.
pl: Źródła NuGet do użycia podczas wyszukiwania nowszych pakietów. Wymaga opcji „--outdated” lub „--deprecated”.
pt_br: As fontes do NuGet a serem usadas ao procurar pacotes mais novos. Exige a opção '--outdated' ou '--deprecated'.
ru: Источники NuGet, используемые при поиске более новых версий пакетов. Требуется указать параметр "--outdated" или "--deprecated".
tr: Daha yeni paketler aranırken kullanılacak NuGet kaynakları. '--outdated' veya '--deprecated' seçeneğini gerektirir.
zh_hans: 搜索较新的包时要使用的 NuGet 源。需要 "--outdated" 或 "--deprecated" 选项。
zh_hant: 搜尋較新套件時要使用的 NuGet 來源。需要使用 '--outdated' 或 '--deprecated' 選項。

# OutdatedAndDeprecatedOptionsCannotBeCombined
source: Option '--outdated' and '--deprecated' cannot be combined.
cs: Možnosti --outdated a --deprecated se nedají kombinovat.
de: Die Optionen "--outdated" und "--deprecated" können nicht kombiniert werden.
es: No se puede combinar la opción "--outdated" y "--deprecated".
fr: Impossible de combiner les options '--outdated' et '--deprecated'.
it: Non è possibile combinare le opzioni '--outdated' e '--deprecated'.
ja: オプション '--outdated' と '--deprecated' を組み合わせることはできません。
ko: '--outdated'와 '--deprecated' 옵션은 함께 사용할 수 없습니다.
pl: Nie można łączyć opcji „--outdated” i „--deprecated”.
pt_br: As opções '--outdated' e '--deprecated' não podem ser combinadas.
ru: Параметры "--outdated" и "--deprecated" не могут использоваться вместе.
tr: '--outdated' ve '--deprecated' seçeneği birleştirilemez.
zh_hans: 不可结合使用 "--outdated" 或 "--deprecated"。
zh_hant: 無法結合選項 '--outdated' 和 '--deprecated'。

# FileNotFound
source: Could not find file or directory '{0}'.
cs: Soubor nebo adresář {0} nešlo najít.
de: Die Datei oder das Verzeichnis "{0}" wurde nicht gefunden.
es: No se pudo encontrar el archivo o directorio "{0}".
fr: Fichier ou répertoire '{0}' introuvable.
it: Non è stato possibile trovare il file o la directory '{0}'.
ja: ファイルまたはディレクトリ '{0}' が見つかりませんでした。
ko: '{0}' 파일 또는 디렉터리를 찾을 수 없습니다.
pl: Nie można odnaleźć pliku lub katalogu „{0}”.
pt_br: Não foi possível encontrar o arquivo ou o diretório '{0}'.
ru: Не удалось найти файл или каталог "{0}".
tr: '{0}' dosyası veya dizini bulunamadı.
zh_hans: 找不到文件或目录“{0}”。
zh_hant: 找不到檔案或目錄 ‘{0}’。

# OutdatedOrDeprecatedOptionOnly
source: Option '{0}' requires the '--outdated' or '--deprecated' option to be specified.
cs: Přepínač {0} vyžaduje, aby se zadal přepínač --outdated nebo --deprecated.
de: Für die Option "{0}" muss die Option "--outdated" oder "--deprecated" angegeben werden.
es: La opción "{0}" requiere que se especifique la opción "--outdated" o "--deprecated".
fr: L'option '{0}' nécessite la spécification de l'option '--outdated' ou '--deprecated'.
it: Con l'opzione '{0}' è necessario specificare l'opzione '--outdated' o '--deprecated'.
ja: オプション '{0}' では '--outdated' または '--deprecated' オプションを指定する必要があります。
ko: '{0}' 옵션을 사용하려면 '--outdated' 또는 '--deprecated' 옵션을 지정해야 합니다.
pl: Opcja „{0}” wymaga określenia opcji „--outdated” lub „--deprecated”.
pt_br: A opção '{0}' exige que a opção '--outdated' ou '--deprecated' seja especificada.
ru: Для параметра "{0}" необходимо указать параметр "--outdated" или "--deprecated".
tr: '{0}' seçeneği '--outdated' veya '--deprecated' seçeneğinin belirtilmesini gerektirir.
zh_hans: 选项“{0}”要求指定 "--outdated" 或 "--deprecated" 选项。
zh_hant: 選項 '{0}' 需要指定 '--outdated' 或 '--deprecated' 選項。
