Repository: dotnet/cli
Catalog: src/dotnet/commands/dotnet-test/xlf/LocalizableStrings.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, tr, zh_hans, zh_hant

# AppFullName
source: .NET Test Driver
de: .NET-Testtreiber
es: Controlador de pruebas de .NET
fr: Pilote de test .NET
ko: .NET 테스트 드라이버
pt_br: Driver de Teste do .NET
ru: Драйвер тестов .NET
tr: .NET Test Sürücüsü
zh_hans: .NET 测试驱动程序
zh_hant: .NET 測試驅動程式

# AppDescription
source: Test Driver for the .NET Platform
de: Testtreiber für die .NET-Plattform
es: Controlador de pruebas para la plataforma .NET
fr: Pilote de test pour la plateforme .NET
ja: .NET Platform 用テスト ドライバー
ko: .NET 플랫폼용 테스트 드라이버입니다.
pt_br: Driver de Teste para a Plataforma .NET
ru: Драйвер тестов для платформы .NET
tr: .NET Platformunun Test Sürücüsü
zh_hans: 适用于 .NET 平台的测试驱动程序
zh_hant: 適用於 .NET 平台的測試驅動程式

# CmdSettingsFile
source: SETTINGS_FILE
es: ARCHIVO_CONFIGURACIÓN
tr: AYAR_DOSYASI

# CmdSettingsDescription
source: The settings file to use when running tests.
de: Die zu verwendenden Testeinstellungen.
es: Configuración que debe usarse para ejecutar las pruebas.
fr: Paramètres à utiliser pendant l'exécution des tests.
ja: テスト実行時に使用する設定
ko: 테스트를 실행할 때 사용할 설정입니다.
pt_br: Configurações a serem usadas ao executar os testes.
ru: Параметры, используемые при выполнении тестов.
tr: Testleri çalıştırırken kullanılacak ayarlar.
zh_hans: 运行测试时要使用的设置。
zh_hant: 執行測試時要使用的設定。

# CmdListTestsDescription
source: List the discovered tests instead of running the tests.
de: Listet die gefundenen Tests auf.
es: Enumera las pruebas detectadas
fr: Répertorie les tests découverts
ja: 探索されたテストを一覧表示する
ko: 검색된 테스트를 나열합니다.
pt_br: Lista os testes descobertos
ru: Список обнаруженных тестов
tr: Bulunan testleri listeler
zh_hans: 列出发现的测试
zh_hant: 列出探索到的測試

# CmdTestCaseFilterExpression
source: EXPRESSION
es: EXPRESIÓN
tr: İFADE

# CmdTestCaseFilterDescription
source: Run tests that match the given expression. Examples: Run tests with priority set to 1: --filter "Priority = 1" Run a test with the specified full name: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Run tests that contain the specified name: --filter "FullyQualifiedName~Namespace.Class" See https://aka.ms/vstest-filtering for more information on filtering support.
de: Führen Sie Tests aus, die dem angegebenen Ausdruck entsprechen. Beispiele: Führen Sie Tests aus, bei denen die Priorität auf 1 festgelegt ist: --filter "Priority = 1" Führen Sie einen Test mit dem angegebenen vollständigen Namen aus: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Führen Sie Tests aus, die den angegebenen Namen enthalten: --filter "FullyQualifiedName~Namespace.Class" Weitere Infos zur Unterstützung der Filterung finden Sie unter: https://aka.ms/vstest-filtering
es: Ejecuta las pruebas que coinciden con una expresión dada. Ejemplos: Ejecuta las pruebas con una prioridad establecida en 1: --filter "Prioridad = 1" Ejecuta una prueba con el nombre completo especificado: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Ejecuta las pruebas que contienen el nombre especificado: --filter "FullyQualifiedName~Namespace.Class" Más información sobre la compatibilidad con el filtrado: https://aka.ms/vstest-filtering
fr: Permet d'exécuter les tests qui correspondent à l'expression indiquée. Exemples : Exécuter les tests de priorité 1 : --filter "Priority = 1" Exécuter un test avec le nom complet spécifié : --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Exécuter les tests qui contiennent le nom spécifié : --filter "FullyQualifiedName~Namespace.Class" En savoir plus sur la prise en charge du filtrage : https://aka.ms/vstest-filtering
ja: 指定された式に一致するテストを実行します。 例: 優先度を 1 に設定してテストを実行する: --filter "Priority = 1" 指定したフル ネームでテストを実行する: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" 指定した名前を含むテストを実行する: --filter "FullyQualifiedName~Namespace.Class" フィルタリング サポートの詳細情報: https://aka.ms/vstest-filtering
ko: 지정된 식과 일치하는 테스트를 실행합니다. 예: 우선 순위가 1로 설정된 테스트 실행: --filter ""Priority = 1"" 지정된 전체 이름이 있는 테스트 실행: --filter ""FullyQualifiedName=Namespace.ClassName.MethodName"" 지정된 이름을 포함하는 테스트 실행: --filter ""FullyQualifiedName~Namespace.Class"" 필터링 지원에 대한 추가 정보: https://aka.ms/vstest-filtering
pt_br: Executa testes que correspondem a determinada expressão. Exemplos: Executar testes com a prioridade definida como 1: --filter "Priority = 1" Executar um teste com o nome completo especificado: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Executar testes que contêm o nome especificado: --filter "FullyQualifiedName~Namespace.Class" Mais informações sobre o suporte à filtragem: https://aka.ms/vstest-filtering
ru: Выполнение тестов, соответствующих данному выражению. Примеры: Запуск тестов с приоритетом 1: --filter "Priority = 1" Запуск теста с указанным полным именем: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Запуск тестов, содержащих указанное имя: --filter "FullyQualifiedName~Namespace.Class" Дополнительные сведения о поддержке фильтрации: https://aka.ms/vstest-filtering
tr: Belirtilen ifadeyle eşleşen testleri çalıştırır. Örnekler: Önceliği 1: --filter "Priority = 1" olarak ayarlanmış testleri çalıştırır Belirtilen tam ada sahip bir test çalıştırır: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" Belirtilen adı içeren testleri çalıştırır: --filter "FullyQualifiedName~Namespace.Class" Filtreleme desteği hakkında daha fazla bilgi: https://aka.ms/vstest-filtering
zh_hans: 运行与给定表达式匹配的测试。 示例: -运行优先级设置为 1 的测试: --filter "Priority = 1" 运行指定全名的测试: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" 运行包含指定名称的测试: --filter "FullyQualifiedName~Namespace.Class" 有关筛选支持的详细信息: https://aka.ms/vstest-filtering
zh_hant: 執行符合指定運算式的測試。 範例: 執行測試，其中優先順序設為 1: --filter "Priority = 1" 使用指定的全名執行測試: --filter "FullyQualifiedName=Namespace.ClassName.MethodName" 執行內含指定名稱的測試: --filter "FullyQualifiedName~Namespace.Class" 篩選資源的詳細資訊: https://aka.ms/vstest-filtering

# CmdTestAdapterPathDescription
source: The path to the custom adapters to use for the test run.
de: Verwenden Sie im Testlauf benutzerdefinierte Adapter aus dem angegebenen Pfad. Beispiel: --test-adapter-path <PFAD_ZUM_ADAPTER>
es: Indica que se usen adaptadores personalizados de la ruta de acceso dada en la serie de pruebas. Ejemplo: --test-adapter-path <RUTA_DE_ADAPTADOR>
fr: Utilisez des adaptateurs personnalisés provenant du chemin indiqué dans la série de tests. Exemple : --test-adapter-path <CHEMIN_ADAPTATEUR>
ja: テストの実行では、指定されたパスのカスタム アダプターを使用します。 例: --test-adapter-path <PATH_TO_ADAPTER>
ko: 테스트 실행에서 지정된 경로에 있는 사용자 지정 어댑터를 사용합니다. 예: --test-adapter-path <PATH_TO_ADAPTER>
pt_br: Usar adaptadores personalizados do caminho especificado na execução de teste. Exemplo: --test-adapter-path <CAMINHO_PARA_ADAPTADOR>
ru: Использование настраиваемых адаптеров по заданному пути в тестовом запуске. Пример: --test-adapter-path <PATH_TO_ADAPTER>
tr: Test çalıştırmasında, belirtilen yoldaki özel bağdaştırıcıları kullanır. Örnek: --test-adapter-path <BAĞDAŞTIRICI_YOLU>
zh_hans: 在测试运行中从给定路径使用自定义适配器。 示例: --test-adapter-path <PATH_TO_ADAPTER>
zh_hant: 從測試回合中的指定路徑使用自訂配接器。 範例: --test-adapter-path <PATH_TO_ADAPTER>

# CmdLoggerOption
source: LOGGER
de: LoggerUri/FriendlyName
es: URIdelRegistrador/NombreDescriptivo
fr: UriEnregistreur/NomConvivial
ja: LoggerUri/FriendlyName
ko: LoggerUri/FriendlyName
pt_br: LoggerUri/FriendlyName
ru: LoggerUri/FriendlyName
tr: LoggerUri/FriendlyName
zh_hans: LoggerUri/FriendlyName
zh_hant: LoggerUri/FriendlyName

# CmdLoggerDescription
source: The logger to use for test results. Examples: Log in trx format using a unique file name: --logger trx Log in trx format using the specified file name: --logger "trx;LogFileName=<TestResults.trx>" See https://aka.ms/vstest-report for more information on logger arguments.
es: Especifique un registrador para los resultados de la prueba. Ejemplo: Inicie sesión en formato trx mediante un nombre de archivo único: --logger trx Inicie sesión en formato trx mediante el nombre de archivo especificado: --logger "trx;LogFileName=<TestResults.trx>" Más informacióin sobre la compatibilidad de los argumentos del registrador: https://aka.ms/vstest-report
fr: Spécifiez un journal pour les résultats de test. Exemples : Journal au format trx avec un nom de fichier unique : --logger trx Journal au format trx avec le nom de fichier spécifié : --logger "trx;LogFileName=<TestResults.trx>" Informations supplémentaires sur la prise en charge des arguments de journal :https://aka.ms/vstest-report
zh_hant: 指定測試結果的記錄器。 範例: 使用唯一的檔案名稱以 trx 格式記錄: --logger trx 使用指定的檔案名稱以 trx 格式記錄: --logger "trx;LogFileName=<TestResults.trx>" 記錄器引數支援的詳細資訊: https://aka.ms/vstest-report

# CmdOutputDir
source: OUTPUT_DIR
es: DIRECTORIO_DE_SALIDA
tr: ÇIKIŞ_DİZİNİ

# CmdOutputDescription
source: The output directory to place built artifacts in.
de: Verzeichnis mit den auszuführenden Binärdateien
es: Directorio donde deben buscarse los archivos binarios para ejecutar
fr: Répertoire dans lequel rechercher les binaires à exécuter
ja: 実行するバイナリを検索するディレクトリ
ko: 실행할 이진 파일을 찾을 디렉터리입니다.
pt_br: Diretório no qual localizar os binários a serem executados
ru: Каталог, в котором требуется найти выполняемые двоичные файлы.
tr: Çalıştırılacak ikililerin bulunacağı dizin
zh_hans: 在其中查找要运行的二进制文件的目录
zh_hant: 要從中尋找要執行之二進位檔的目錄

# CmdPathToLogFile
source: LOG_FILE
de: PATH_TO_FILE
es: RUTA_ACCESO_ARCHIVO
fr: PATH_TO_FILE
ja: PATH_TO_FILE
ko: PATH_TO_FILE
pt_br: PATH_TO_FILE
ru: PATH_TO_FILE
tr: DOSYA_YOLU
zh_hans: PATH_TO_FILE
zh_hant: PATH_TO_FILE

# CmdPathTologFileDescription
source: Enable verbose logging to the specified file.
de: Aktivieren Sie ausführliche Protokolle für die Testplattform. Protokolle werden in die angegebene Datei geschrieben.
es: Habilita registros detallados para la plataforma de pruebas. Los registros se escriben en el archivo proporcionado.
fr: Activez les journaux détaillés pour la plateforme de test. Les journaux sont écrits dans le fichier fourni.
ja: "テスト プラットフォームの詳細ログを有効にします。 ログは指定されたファイルに書き込まれます。"
ko: 테스트 플랫폼에 대해 자세한 정보 표시 로그를 사용하도록 설정합니다. 로그가 제공된 파일에 기록됩니다.
pt_br: Habilite os logs detalhados para a plataforma de teste. Os logs são gravados no arquivo fornecido.
ru: Включение подробных журналов для платформы тестирования. Журналы записываются в указанный файл.
tr: Test platformu için ayrıntılı günlükleri etkinleştirir. Günlükler belirtilen dosyaya yazılır.
zh_hans: 启用测试平台的详细日志。 日志写入到提供的文件中。
zh_hant: 啟用測試平台的詳細資訊記錄。 記錄已寫入提供的檔案中。

# CmdNoBuildDescription
source: Do not build the project before testing. Implies --no-restore.
de: Erstellt das Projekt nicht vor dem Testen. Impliziert "--no-restore".
es: No compile el proyecto antes de probarlo. Implica --no-restore.
fr: Ne pas générer le projet avant les tests. Implique --no-restore.
ja: テストする前にプロジェクトをビルドしないでください。--no-restore を意味します。
ko: 테스트하기 전에 프로젝트를 빌드하지 않습니다. 복원 없음을 의미합니다.
pt_br: Não compile o projeto antes de testar. Implica em --no-restore.
ru: Сборка проекта перед тестированием не выполняется. Подразумевает --no-restore.
tr: Test etmeden önce projeyi derlemeyin. --no-restore anlamına gelir.
zh_hans: 测试之前不要生成项目。Implies --no-restore.
zh_hant: 請勿在測試之前建置專案。提示：-no-restore。

# CmdTestAdapterPath
source: ADAPTER_PATH
de: PATH_TO_ADAPTER
es: RUTA_DE_ADAPTADOR
fr: PATH_TO_ADAPTER
ja: PATH_TO_ADAPTER
ko: PATH_TO_ADAPTER
pt_br: PATH_TO_ADAPTER
ru: PATH_TO_ADAPTER
tr: PATH_TO_ADAPTER
zh_hans: PATH_TO_ADAPTER
zh_hant: PATH_TO_ADAPTER

# CmdResultsDirectoryDescription
source: The directory where the test results will be placed. The specified directory will be created if it does not exist.
de: Das Verzeichnis, in dem die Testergebnisse abgelegt werden. Das angegebene Verzeichnis wird erstellt, wenn es nicht vorhanden ist. Beispiel: --results-directory <PATH_TO_RESULTS_DIRECTORY>
es: El directorio donde se van a colocar los resultados de prueba. Si no existe, se creará el directorio especificado. Ejemplo: --results-directory <RUTA_DE_DIRECTORIO_DE_RESULTADOS>
fr: Répertoire où les résultats des tests vont être placés. Le répertoire spécifié est créé, s'il n'existe pas déjà. Exemple : --results-directory <PATH_TO_RESULTS_DIRECTORY>
ja: テスト結果が配置されるディレクトリ。存在しない場合、指定のディレクトリが作成されます。 例: --results-directory <PATH_TO_RESULTS_DIRECTORY>
ko: 테스트 결과를 배치할 디렉터리입니다. 지정한 디렉터리가 존재하지 않는 경우 생성됩니다. 예: --results-directory <PATH_TO_RESULTS_DIRECTORY>
pt_br: O diretório em que os resultados de teste serão colocados. O diretório especificado será criado, caso não exista. Exemplo: --results-directory <PATH_TO_RESULTS_DIRECTORY>
ru: Каталог, в который будут помещаться результаты тестов. Если указанный каталог не существует, он будет создан. Пример: --results-directory <PATH_TO_RESULTS_DIRECTORY>
tr: Test sonuçlarının yerleştirileceği dizin. Belirtilen dizin yoksa, oluşturulur. Örnek: --results-directory <PATH_TO_RESULTS_DIRECTORY>
zh_hans: 要放置测试结果的目录。若不存在，将创建指定目录。 示例: --results-directory <PATH_TO_RESULTS_DIRECTORY>
zh_hant: 用於置放測試結果的目錄。若指定的目錄不存在，則會建立該目錄。 範例: --results-directory <PATH_TO_RESULTS_DIRECTORY>

# CmdPathToResultsDirectory
source: RESULTS_DIR
de: PATH_TO_RESULTS_DIRECTORY
es: RUTA_DE_DIRECTORIO_DE_RESULTADOS
fr: PATH_TO_RESULTS_DIRECTORY
ja: PATH_TO_RESULTS_DIRECTORY
ko: PATH_TO_RESULTS_DIRECTORY
pt_br: PATH_TO_RESULTS_DIRECTORY
ru: PATH_TO_RESULTS_DIRECTORY
tr: PATH_TO_RESULTS_DIRECTORY
zh_hans: PATH_TO_RESULTS_DIRECTORY
zh_hant: PATH_TO_RESULTS_DIRECTORY

# RunSettingsArgumentsDescription
source: RunSettings arguments: Arguments to pass as RunSettings configurations. Arguments are specified as '[name]=[value]' pairs after "-- " (note the space after --). Use a space to separate multiple '[name]=[value]' pairs. See https://aka.ms/vstest-runsettings-arguments for more information on RunSettings arguments. Example: dotnet test -- MSTest.DeploymentEnabled=false MSTest.MapInconclusiveToFailed=True
de: RunSettings-Argumente: Argumente zum Übergeben von RunSettings-Konfigurationen über die Befehlszeile. Argumente werden unter Umständen als Name-Wert-Paar der Form [Name]=[Wert] nach "-- " übergeben. Beachten Sie das Leerzeichen nach "--". Trennen Sie mehrere Paare der Form [Name]=[Wert] mithilfe von Leerzeichen. Weitere Informationen zur Unterstützung von RunSettings-Argumenten: https://aka.ms/vstest-runsettings-arguments Beispiel: "dotnet test -- MSTest.DeploymentEnabled=false MSTest.MapInconclusiveToFailed=True"
es: Argumentos RunSettings: Argumentos para pasar configuraciones de runsettings mediante la línea de comandos. Los argumentos se pueden especificar como pares de nombre-valor con el formato [nombre]=[valor] después de "-- ". Observe el espacio después de --. Use un espacio para separar varios pares de[nombre] =[valor]. Más información sobre la compatibilidad con argumentos RunSettings: https://aka.ms/vstest-runsettings-arguments Ejemplo: dotnet test -- MSTest.DeploymentEnabled=false MSTest.MapInconclusiveToFailed=True
fr: Arguments de RunSettings : Arguments permettant de passer les configurations des paramètres d'exécution via la ligne de commande. Vous pouvez spécifier les arguments en tant que paires nom-valeur sous la forme [name]=[value] après "-- ". Notez l'espace après --. Utilisez un espace pour séparer plusieurs [name]=[value]. En savoir plus sur la prise en charge des arguments de RunSettings : https://aka.ms/vstest-runsettings-arguments Exemple : dotnet test -- MSTest.DeploymentEnabled=false MSTest.MapInconclusiveToFailed=True
ja: RunSettings 引数: commandline 経由で runsettings 構成を渡す引数。引数は、"-- " の後に [name]=[value] の形式で名前と値のペアとして指定できます。-- の後のスペースにご注意ください。 複数の [name] =[value] を区切るにはスペースを使用します。 RunSettings 引数のサポートに関する詳細情報: https://aka.ms/vstest-runsettings-arguments 例: dotnet test -- MSTest.DeploymentEnabled=false MSTest.MapInconclusiveToFailed=True
ko: RunSettings 인수: 명령줄을 통해 runsettings 구성을 전달하기 위한 인수입니다. 인수는 "-- " 뒤에 [name]=[value] 형식의 이름-값 쌍으로 지정될 수 있습니다. -- 뒤의 공백에 주의하세요. 여러 [name] =[value]를 구분하려면 공백을 사용합니다. RunSettings 인수 지원에 대한 자세한 정보: https://aka.ms/vstest-runsettings-arguments 예: dotnet test -- MSTest.DeploymentEnabled=false MSTest.MapInconclusiveToFailed=True
pt_br: Argumentos RunSettings: Argumentos para passar configurações de runsettings por meio de commandline. Os argumentos podem ser especificados como um par nome-valor na forma [name]=[value] depois de "-- ". Observe o espaço após --. Use um espaço para separar vários [name] =[value]. Mais informações sobre suporte a argumentos RunSettings: https://aka.ms/vstest-runsettings-arguments Exemplo: dotnet test -- MSTest.DeploymentEnabled=false MSTest.MapInconclusiveToFailed=True
ru: Аргументы RunSettings: Аргументы для передачи конфигураций runsettings через командную строку. Аргументы могут быть указаны как пары "имя-значение" в формате [имя]=[значение] после "-- ". Обратите внимание на пробел после --. Используйте пробел для разделения нескольких пар [имя]=[значение]. Дополнительные сведения о поддержке аргументов RunSettings: https://aka.ms/vstest-runsettings-arguments Пример: dotnet test -- MSTest.DeploymentEnabled=false MSTest.MapInconclusiveToFailed=True
tr: RunSettings bağımsız değişkenleri: Komut satırı aracılığıyla runsettings yapılandırmalarını geçirmeye yönelik bağımsız değişkenler. Bağımsız değişkenler, "-- " karakterlerinden sonra [ad]=[değer] biçiminde ad-değer çifti olarak belirtilebilir. -- karakterlerinden sonra boşluk olduğuna dikkat edin. Birden fazla [ad] =[değer] çiftini ayırmak için boşluk kullanın. RunSettings bağımsız değişkenleri desteği hakkında daha fazla bilgi: https://aka.ms/vstest-runsettings-arguments Örnek: dotnet test -- MSTest.DeploymentEnabled=false MSTest.MapInconclusiveToFailed=True
zh_hans: RunSettings 参数: 要通过命令行传递 runsettings 配置的参数。参数可指定为名称-值对，其形式为 "-- " 后跟 [名称]=[值]。请注意 -- 后面的空格。 使用空格分隔多个 [名称] =[值]。 有关 RunSettings 参数支持的详细信息: https://aka.ms/vstest-runsettings-arguments 示例: dotnet test -- MSTest.DeploymentEnabled=false MSTest.MapInconclusiveToFailed=True
zh_hant: RunSettings 引數: 透過命令列傳遞 runsettings 組態的引數。引數可以接在 "-- " 之後，以 [名稱]=[值] 的格式指定為成對的「名稱/值」。請注意 -- 之後的空格。 請使用空格隔開多個 [名稱]=[值]。 RunSettings 引數支援的詳細資訊: https://aka.ms/vstest-runsettings-arguments 範例: dotnet test -- MSTest.DeploymentEnabled=false MSTest.MapInconclusiveToFailed=True

# cmdCollectFriendlyName
source: DATA_COLLECTOR_NAME
de: DATA_COLLECTOR_FRIENDLY_NAME
es: NOMBRE_DESCRIPTIVO_DE_RECOPILADOR_DE_DATOS
fr: DATA_COLLECTOR_FRIENDLY_NAME
ja: DATA_COLLECTOR_FRIENDLY_NAME
ko: DATA_COLLECTOR_FRIENDLY_NAME
pt_br: DATA_COLLECTOR_FRIENDLY_NAME
ru: DATA_COLLECTOR_FRIENDLY_NAME
tr: DATA_COLLECTOR_FRIENDLY_NAME
zh_hans: DATA_COLLECTOR_FRIENDLY_NAME
zh_hant: DATA_COLLECTOR_FRIENDLY_NAME

# cmdCollectDescription
source: The friendly name of the data collector to use for the test run. More info here: https://aka.ms/vstest-collect
de: Aktiviert den Datensammler für den Testlauf. Weitere Informationen finden Sie hier: https://aka.ms/vstest-collect
es: Habilita el recopilador de datos para la serie de pruebas. Más información aquí: https://aka.ms/vstest-collect
fr: Active le collecteur de données pour la série de tests. Plus d'informations ici : https://aka.ms/vstest-collect
ja: テスト実行用にデータ コレクターを有効にします。 詳細情報: https://aka.ms/vstest-collect
ko: 테스트 실행에 대해 데이터 수집기를 사용하도록 설정합니다. 자세한 정보: https://aka.ms/vstest-collect
pt_br: Habilita o coletor de dados para a execução de teste. Mais informações aqui: https://aka.ms/vstest-collect
ru: Включает сборщик данных для тестового запуска. Дополнительные сведения: https://aka.ms/vstest-collect
tr: Test çalıştırması için veri toplayıcıyı etkinleştirir. Daha fazla bilgi için bkz. https://aka.ms/vstest-collect
zh_hans: 为测试运行启用数据收集器。 有关详细信息，请访问: https://aka.ms/vstest-collect
zh_hant: 為測試回合啟用資料收集器。 如需詳細資訊，請參閱: https://aka.ms/vstest-collect

# CmdBlameDescription
source: Run the tests in blame mode. This option is helpful in isolating a problematic test causing the test host to crash. Outputs a 'Sequence.xml' file in the current directory that captures the order of execution of test before the crash.
de: Führt den Test im Modus "Verantwortung zuweisen" aus. Diese Option hilft bei der Isolierung des problematischen Tests, der den Absturz des Testhosts verursacht. Im aktuellen Verzeichnis wird eine Ausgabedatei "Sequence.xml" erstellt, in der die Reihenfolge der Testausführung vor dem Absturz erfasst wird.
es: Ejecuta la prueba en modo de culpa. Esta opción es útil para aislar la prueba problemática que provoca el bloqueo del host de prueba. Crea un archivo de salida en el directorio actual como "Sequence.xml" que captura el orden de ejecución de la prueba antes del bloqueo.
fr: Exécute le test en mode blame (responsabilité). Cette option permet d'isoler le test problématique qui est à l'origine d'un incident sur l'hôte de test. Elle crée dans le répertoire actif un fichier de sortie nommé "Sequence.xml", qui capture l'ordre d'exécution du test avant l'incident.
ja: 変更履歴モードでテストを実行します。このオプションは、テスト ホストのクラッシュの原因となる問題のあるテストを分離する場合に役立ちます。現在のディレクトリに、クラッシュする前のテスト実行順序を示す出力ファイル "Sequence.xml" が作成されます。
ko: 테스트를 원인 모드로 실행합니다. 이 옵션은 테스트 호스트 크래시를 유발하는 문제 있는 테스트를 격리하는 데 유용합니다. 이 경우 현재 디렉터리에 "Sequence.xml"이라는 출력 파일을 만들며, 이 파일에는 크래시 이전의 테스트 실행 순서가 캡처됩니다.
pt_br: Executa o teste em modo de acusação. Essa opção é útil para isolar o teste problemático, causando uma falha no host de teste. Cria um arquivo de saída no diretório atual como "Sequence.xml", que captura a ordem de execução do teste antes da falha.
ru: Запускает тест в режиме обвинения. Этот параметр нужен, чтобы изолировать проблемный тест, вызывающий сбой хоста для тестов. Он создает в текущем каталоге файл выходных данных (Sequence.xml), в котором записывается порядок выполнения теста перед сбоем.
tr: Testi blame modunda çalıştırır. Bu seçenek, test konağının kilitlenmesine neden olan sorunlu testi belirlemek için kullanışlıdır. Geçerli dizinde testin kilitlenmeden önceki yürütme sırasını yakalayan "Sequence.xml" adlı bir çıkış dosyası oluşturur.
zh_hans: 在追责模式下运行测试。此选项有助于隔离有问题的测试，以免导致测试主机崩溃。它会在当前目录中创建一个输出文件 "Sequence.xml"，用于在崩溃之前捕获测试的执行顺序。
zh_hant: 在 Blame 模式中執行測試。此選項有助於隔離造成測試主機損毀的問題測試。其會在目前的目錄中建立 "Sequence.xml" 這樣的輸出檔案，以擷取損毀前執行測試的順序。
