Repository: dotnet/cli
Catalog: src/dotnet/commands/dotnet-test/xlf/LocalizableStrings.*.xlf
Languages: de, es, fr, ja, ko, pt_br, ru, tr, zh_hans, zh_hant

# CmdLoggerDescription
source: The logger to use for test results. Examples: Log in trx format using a unqiue file name: --logger trx Log in trx format using the specified file name: --logger "trx;LogFileName=<TestResults.trx>" See https://aka.ms/vstest-report for more information on logger arguments.
de: Geben Sie einen Protokollierer für Testergebnisse an. Beispiele: Protokoll im TRX-Format mit eindeutigem Dateinamen: --logger trx Protokoll im TRX-Format mit angegebenem Dateinamen: --logger "trx;LogFileName=<TestResults.trx>" Weitere Informationen zur Unterstützung von Argumenten des Protokollierers finden Sie unter: https://aka.ms/vstest-report
ja: テスト結果のロガーを指定します。 例: 一意のファイル名を使用して trx 形式でログインします: --ロガー trx 指定されたファイル名を使用して trx 形式でログインします: --ロガー "trx;LogFileName=<TestResults.trx>" ロガーの引数の詳細情報: https://aka.ms/vstest-report
ko: 테스트 결과에 대해 로거를 지정합니다. 예: 고유한 파일 이름을 사용하여 trx 형식으로 로그인: --logger trx 지정된 파일 이름을 사용하여 trx 형식으로 로그인: --logger "trx;LogFileName=<TestResults.trx>" 로거 인수에 대한 자세한 내용은 support:https://aka.ms/vstest-report를 참조하세요.
pt_br: Especifique um agente para os resultados de teste. Exemplos: Log no formato trx usando uma nome de arquivo exclusivo: --logger trx Log no formato trx usando o nome de arquivo especificado: --logger "trx;LogFileName=<TestResults.trx>" Mais informações sobre os argumentos do agente support:https://aka.ms/vstest-report
ru: Укажите средство ведения журнала для результатов теста. Примеры Журнал TRX с уникальным именем файла: --logger trx Журнал TRX с заданным именем файла: --logger "trx;LogFileName=<результаты_теста.trx>" Дополнительно об аргументах средства ведения журнала: https://aka.ms/vstest-report
tr: Test sonuçları için bir günlükçü belirtin. Örnekler: Benzersiz dosya adı kullanarak trx biçiminde günlük kaydı: --logger trx Belirtilen dosya adını kullanarak trx biçiminde günlük kaydı: --logger "trx;LogFileName=<TestSonuçları.trx>" Günlükçü bağımsız değişkenleri desteği hakkında daha fazla bilgi:https://aka.ms/vstest-report
zh_hans: 为测试结果指定一个记录器。 示例: 使用唯一文件名按 trx 格式进行记录: --logger trx 使用指定的文件名按 trx 格式进行记录: --logger "trx;LogFileName=<TestResults.trx>" 有关记录器参数支持的详细信息，请访问: https://aka.ms/vstest-report
