Repository: dotnet/cli
Catalog: src/dotnet/commands/dotnet-new/xlf/LocalizableStrings.*.xlf
Languages: cs, de, es, it, ja, ko, pt_br, ru, tr, zh_hans, zh_hant

# ProjectExistsError
source: Creating new {0} project failed, project already exists.
cs: Vytvoření nového projektu {0} se nezdařilo, protože projekt už existuje.
de: Fehler beim Erstellen des neuen Projekts "{0}". Das Projekt ist bereits vorhanden.
es: No se pudo crear el nuevo proyecto {0}, porque ya existe.
it: La creazione del nuovo progetto {0} non è riuscita. Il progetto esiste già.
ja: 新しい {0} プロジェクトの作成に失敗しました。プロジェクトは既に存在します。
ko: 새 {0} 프로젝트를 만들지 못했습니다. 프로젝트가 이미 있습니다.
pt_br: Falha ao criar o novo projeto {0}, o projeto já existe.
ru: Ошибка создания проекта {0}: проект уже существует.
tr: Yeni {0} projesi oluşturulamadı, proje zaten var.
zh_hans: 创建新的 {0} 项目失败，项目已存在。
zh_hant: 建立新的 {0} 專案失敗，專案已經存在。

# ProjectContainsError
source: Creating new {0} project failed, directory already contains {1}
cs: Vytvoření nového projektu {0} se nezdařilo, protože adresář už obsahuje {1}.
de: Fehler beim Erstellen des neuen Projekts "{0}". "{1}" ist im Verzeichnis bereits vorhanden.
es: No se pudo crear el nuevo proyecto {0}, porque el directorio ya contiene {1}
it: La creazione del nuovo progetto {0} non è riuscita. La directory contiene già {1}
ja: 新しい {0} プロジェクトの作成に失敗しました。ディレクトリに既に {1} が含まれています
ko: 새 {0} 프로젝트를 만들지 못했습니다. 디렉터리에 {1}이(가) 이미 있습니다.
pt_br: Falha ao criar o novo projeto {0}, o diretório já contém {1}
ru: Ошибка создания проекта {0}: каталог уже содержит {1}
tr: Yeni {0} projesi oluşturulamadı, dizinde zaten {1} var
zh_hans: 创建新的 {0} 项目失败，目录已包含 {1}
zh_hant: 建立新的 {0} 專案失敗，目錄已經包含 {1}

# ProjectFailedError
source: Creating new {0} project failed.
cs: Vytvoření nového projektu {0} se nezdařilo.
de: Fehler beim Erstellen des neuen Projekts "{0}".
es: No se pudo crear el nuevo proyecto {0}.
it: La creazione del nuovo progetto {0} non è riuscita.
ja: 新しい {0} プロジェクトの作成に失敗しました。
ko: 새 {0} 프로젝트를 만들지 못했습니다.
pt_br: Falha ao criar o novo projeto {0}.
ru: Ошибка создания проекта {0}.
tr: Yeni {0} projesi oluşturulamadı.
zh_hans: 创建新的 {0} 项目失败。
zh_hant: 建立新的 {0} 專案失敗。

# CreatedNewProject
source: Created new {0} project in {1}.
cs: V adresáři {1} byl vytvořen nový projekt {0}.
de: Das neue Projekt "{0}" wurde in "{1}" erstellt.
es: Se ha creado el nuevo proyecto {0} en {1}.
it: Il nuovo progetto {0} è stato creato in {1}.
ja: {1} に新しい {0} プロジェクトを作成しました。
ko: 새 {0} 프로젝트를 {1}에 만들었습니다.
pt_br: Criado o novo projeto {0} em {1}.
ru: Проект {0} создан в {1}.
tr: {1} içinde yeni {0} projesi oluşturuldu.
zh_hans: 已在 {1} 中创建新的 {0} 项目。
zh_hant: 在 {1} 中建立新的 {0} 專案。

# AppFullName
source: .NET Initializer
de: .NET-Initialisierer
es: Inicializador de .NET
it: Inizializzatore .NET
ko: .NET 이니셜라이저
pt_br: Inicializador do .NET
ru: Инициализатор .NET
tr: .NET Başlatıcısı
zh_hans: .NET 初始值设定项
zh_hant: .NET 初始設定式

# AppDescription
source: Initializes empty project for .NET Platform
cs: Inicializuje prázdný projekt pro platformu .NET.
de: Initialisiert ein leeres Projekt für die .NET-Plattform.
es: Inicializa un proyecto vacío para la plataforma .NET
it: Inizializza il progetto vuoto per la piattaforma .NET
ja: .NET Platform の空のプロジェクトを初期化する
ko: .NET 플랫폼용 빈 프로젝트를 초기화합니다.
pt_br: Inicializa um projeto em branco para a Plataforma .NET
ru: Инициализация пустого проекта для платформы .NET
tr: .NET Platformu için boş proje başlatır
zh_hans: 初始化 .NET 平台的空项目
zh_hant: 為 .NET 平台將空專案初始化

# ValidValuesText
source: Valid values for {0}: {1}.
cs: Platné hodnoty pro {0}: {1}
de: Gültige Werte für "{0}": {1}.
es: Valores válidos para {0}: {1}.
it: Valori validi per {0}: {1}.
ja: {0} の有効な値: {1}。
ko: {0}의 유효한 값은 {1}입니다.
pt_br: Valores válidos para {0}: {1}.
ru: Допустимые значения для {0}: {1}.
tr: {0} için geçerli değerler: {1}.
zh_hans: {0}: {1} 的有效值。
zh_hant: {0} 的有效值: {1}。

source: LANGUAGE
es: LENGUAJE
it: LINGUAGGIO
pt_br: LINGUAGEM
tr: DİL
zh_hant: 語言

# LanguageOfProject
source: Language of project Valid values: {0}.
cs: Jazyk projektu Platné hodnoty: {0}
de: Sprache des Projekts. Gültige Werte: {0}.
es: Lenguaje del proyecto. Valores válidos: {0}.
it: Linguaggio del progetto Valori validi: {0}.
ja: プロジェクトの言語 有効な値: {0}。
ko: 프로젝트의 언어 유효한 값은 {0}입니다.
pt_br: Idioma do projeto Valores válidos: {0}.
ru: Язык проекта Допустимые значения: {0}.
tr: Projenin dili Geçerli değerler: {0}.
zh_hans: 项目语言 有效值: {0}。
zh_hant: 專案的語言 有效值: {0}。

source: TYPE
es: TIPO
it: TIPO
pt_br: TIPO
tr: TÜR
zh_hant: 類型

# TypeOfProject
source: Type of project {0}
cs: Typ projektu {0}
de: Art des Projekts {0}
es: Tipo de proyecto {0}
it: Tipo del progetto {0}
ja: プロジェクトの種類 {0}
ko: 프로젝트 형식 {0}
pt_br: Tipo do projeto {0}
ru: Тип проекта {0}
tr: Projenin türü {0}
zh_hans: 项目类型 {0}
zh_hant: 專案的類型 {0}

# UnrecognizedLanguage
source: Unrecognized language: {0}
cs: Nerozpoznaný jazyk: {0}
de: Unbekannte Sprache: {0}
es: Lenguaje no reconocido: {0}
it: Linguaggio non riconosciuto: {0}
ja: 認識できない言語: {0}
ko: 인식할 수 없는 언어: {0}
pt_br: Idioma não reconhecido: {0}
ru: Нераспознанный язык: {0}
tr: Tanınmayan dil: {0}
zh_hans: 未识别的语言: {0}
zh_hant: 無法辨識的語言: {0}

# UnrecognizedType
source: Unrecognized type: {0}
cs: Nerozpoznaný typ: {0}
de: Unbekannter Typ: {0}
es: Tipo no reconocido: {0}
it: Tipo non riconosciuto: {0}
ja: 認識できない種類: {0}
ko: 인식할 수 없는 형식: {0}
pt_br: Tipo não reconhecido: {0}
ru: Нераспознанный тип: {0}
tr: Tanınmayan tür: {0}
zh_hans: 未识别的类型: {0}
zh_hant: 無法辨識的類型: {0}

# AvailableTypes
source: Available types for {0} :
cs: Dostupné typy pro {0}:
de: Verfügbare Typen für "{0}":
es: Tipos disponibles para {0} :
it: Tipi disponibili per {0}:
ja: {0} に対して使用可能な種類:
ko: {0}에 사용 가능한 형식:
pt_br: Tipos disponíveis para {0}:
ru: Доступные типы для {0}:
tr: {0} için kullanılabilir türler:
zh_hans: {0} 的可用类型:
zh_hant: {0} 的可用類型:
