Repository: dotnet/cli
Catalog: src/Microsoft.DotNet.Cli.Sln.Internal/xlf/LocalizableStrings.*.xlf
Languages: es, pl, ru, zh_hans, zh_hant

# GlobalSectionMoreThanOnceError
source: Global section specified more than once
es: Sección global especificada más de una vez
pl: Sekcja globalna została określona więcej niż raz
ru: Глобальный раздел указан более одного раза.
zh_hans: 多次指定了全局节
zh_hant: 全域區段指定了一次以上

# GlobalSectionNotClosedError
source: Global section not closed
es: Sección global no cerrada
pl: Nie zamknięto sekcji globalnej
ru: Глобальный раздел не закрыт.
zh_hans: 未关闭全局节
zh_hant: 全域區段未關閉

# FileHeaderMissingError
source: Expected file header not found
es: No se encontró el encabezado de archivo esperado
pl: Nie znaleziono oczekiwanego nagłówka pliku
ru: Отсутствует требуемый заголовок файла
zh_hans: 未找到必需的文件头
zh_hant: 找不到預期的檔案標頭

# ProjectSectionNotClosedError
source: Project section not closed
es: Sección de proyecto no cerrada
pl: Nie zamknięto sekcji projektu
ru: Раздел проекта не закрыт.
zh_hans: 未关闭项目节
zh_hant: 專案區段未關閉

# InvalidSectionTypeError
source: Invalid section type: {0}
es: Tipo de sección no válido: {0}
pl: Nieprawidłowy typ sekcji: {0}
ru: Недопустимый тип раздела: {0}
zh_hans: 无效的节类型: {0}
zh_hant: 區段類型無效: {0}

# SectionIdMissingError
source: Section id missing
es: Id. de sección omitido
pl: Brak identyfikatora sekcji
ru: Отсутствует идентификатор раздела.
zh_hans: 缺少节 ID
zh_hant: 遺漏區段識別碼

# ClosingSectionTagNotFoundError
source: Closing section tag not found
es: No se encuentra la etiqueta de cierre de la sección
pl: Nie odnaleziono tagu zamykającego sekcję
ru: Закрывающий тег раздела не найден.
zh_hans: 未找到结束节标记
zh_hant: 找不到關閉區段標記

# ErrorMessageFormatString
source: Invalid format in line {0}: {1}
es: Formato no válido en línea {0}: {1}
pl: Nieprawidłowy format w wierszu {0}: {1}
ru: Формат в строке {0} недопустим: {1}
zh_hans: 行 {0} 存在无效格式: {1}
zh_hant: 第 {0} 行的格式不正確: {1}

# ProjectParsingErrorFormatString
source: Project section is missing '{0}' when parsing the line starting at position {1}
es: Falta la sección del proyecto "{0}" al analizar la línea que inicia en la posición {1}
pl: W sekcji projektu brakuje elementu „{0}” podczas analizowania wiersza, począwszy od pozycji {1}
ru: В разделе проекта отсутствует "{0}" при анализе строки с начальной позицией {1}
zh_hans: 分析从位置 {1} 开始的行时，项目节缺少“{0}”
zh_hant: 從位置 {1} 開始剖析程式行時，專案區段缺少 '{0}'

# InvalidPropertySetFormatString
source: Property set is missing '{0}'
es: A la propiedad establecida le falta "{0}"
pl: W zestawie właściwości brakuje elementu „{0}”
ru: В наборе свойств отсутствует "{0}"
zh_hans: 属性集缺少“{0}”
zh_hant: 屬性集缺少 '{0}'

# FileHeaderMissingVersionError
source: File header is missing version
es: Falta la versión del encabezado de archivo
pl: Brak wersji nagłówka pliku
ru: В заголовке файла отсутствует версия
zh_hans: 文件头缺少版本
zh_hant: 檔案標頭遺漏版本
