Repository: dotnet/cli
Catalog: src/dotnet/commands/dotnet-store/xlf/LocalizableStrings.*.xlf
Languages: de

# AppDescription
source: Stores the specified assemblies for the .NET Platform. By default, these will be optimized for the target runtime and framework.
de: Speichert die angegebenen Assemblys für die .NET-Plattform. Standardmäßig werden diese für die Zielruntime und das Framework optimiert.

# OutputOptionDescription
source: The output directory to store the given assemblies in.
de: Ausgabeverzeichnis, in dem die angegebenen Assemblys gespeichert werden.

# FrameworkVersionOptionDescription
source: The Microsoft.NETCore.App package version that will be used to run the assemblies.
de: Die Microsoft.NETCore.App-Paketversion, die zum Ausführen der Assemblys verwendet wird.

# IntermediateWorkingDirOption
source: WORKING_DIR
de: IntermediateWorkingDir

# IntermediateWorkingDirOptionDescription
source: The working directory used by the command to execute.
de: Das vom auszuführenden Befehl verwendete Verzeichnis.

# IntermediateDirExists
source: Intermediate working directory {0} already exists. Remove {0} or specify another directory with -w.
de: Das Zwischenarbeitsverzeichnis {0} ist bereits vorhanden. Entfernen Sie {0}, oder geben Sie mit "-w" ein anderes Verzeichnis an.

# SkipOptimizationOptionDescription
source: Skip the optimization phase.
de: Überspringt die Optimierungsphase.

# ProjectManifestDescription
source: The XML file that contains the list of packages to be stored.
de: Die XML-Datei, die die Liste der zu speichernden Pakete enthält.

# SkipSymbolsOptionDescription
source: Skip creating symbol files which can be used for profiling the optimized assemblies.
de: Überspringt das Erstellen von Symboldateien, die für die Profilerstellung der optimierten Assemblys verwendet wird.

# SpecifyManifests
source: Specify at least one manifest with --manifest.
de: Geben Sie mit "--manifest" mindestens ein Manifest an.
