Repository: dotnet/cli
Catalog: src/dotnet/commands/dotnet-migrate/xlf/LocalizableStrings.*.xlf
Languages: cs, de, es, fr, ja, ko

# AppFullName
source: .NET Migrate Command
cs: Příkaz .NET pro migraci
de: .NET-Befehl "Migrate"
es: Comando Migrate de .NET
fr: Commande de migration .NET
ja: .NET Migrate コマンド
ko: .NET 마이그레이션 명령

# AppDescription
source: Command used to migrate project.json projects to msbuild
cs: Příkaz se používá k migraci projektů project.json na MSBuild
de: Befehl zum Migrieren von project.json-Projekten zu MSBuild
es: Comando usado para migrar proyectos project.json a MSBuild
fr: Commande utilisée pour migrer les projets project.json vers msbuild
ja: project.json プロジェクトを msbuild に移行するために使用するコマンド
ko: project.json 프로젝트를 msbuild로 마이그레이션하는 데 사용하는 명령입니다.

# CmdProjectArgumentDescription
source: The path to one of the following: - a project.json file to migrate. - a global.json file, it will migrate the folders specified in global.json. - a solution.sln file, it will migrate the projects referenced in the solution. - a directory to migrate, it will recursively search for project.json files to migrate. Defaults to current directory if nothing is specified.
cs: Cesta k jednomu z následujících umístění: - k migrovanému souboru project.json - k souboru global.json (Migrovat se budou složky zadané v souboru global.json.) - k souboru solution.sln (Migrovat se budou projekty odkazované v řešení.) - k migrovanému adresáři (Rekurzivně vyhledá migrované soubory project.json.) Výchozí hodnota je aktuální adresář (pokud není zadaný jiný adresář).
de: Der Pfad zu einem der folgenden Elemente: – Datei vom Typ "project.json", die migriert werden soll – Datei vom Typ "global.json", mit der die in "global.json" angegebenen Ordner migriert werden – Datei vom Typ "solution.sln", mit der die in der Projektmappe referenzierten Projekte migriert werden – Verzeichnis für die Migration, es wird rekursiv nach zu migrierenden Dateien vom Typ "project.json" gesucht Ohne Angabe wird standardmäßig das aktuelle Verzeichnis verwendet.
es: La ruta de acceso a cada uno de los siguientes elementos: - un archivo project.json para migrarlo, - un archivo global.json; migra las carpetas especificadas en global.json, - un archivo solution.sln; migra los proyectos a los que se hace referencia en la solución, - un directorio para migrar; busca archivos project.json de forma recursiva para migrarlos. Si no se especifica ninguno, usa el directorio actual de forma predeterminada.
fr: Chemin de l'un des éléments suivants : - fichier project.json à faire migrer ; - fichier global.json qui effectue la migration des dossiers spécifiés dans global.json ; - fichier solution.sln qui effectue la migration des projets référencés dans la solution ; - répertoire à faire migrer, où est effectuée une recherche récursive des fichiers project.json à faire migrer. La valeur par défaut correspond au répertoire actif, si rien n'est spécifié.
ja: 次のいずれかへのパスです。 - 移行する project.json ファイル。 - global.json ファイル。global.json に指定されているフォルダーを移行します。 - solution.sln ファイル。ソリューションで参照されているプロジェクトを移行します。 - 移行するディレクトリ。移行する project.json ファイルを再帰的に検索します。 何も指定しない場合、既定は現在のディレクトリです。
ko: 다음 중 하나의 경로입니다. - 마이그레이션할 project.json 파일 - global.json 파일. global.json에 지정된 폴더를 마이그레이션합니다. - solution.sln 파일. 솔루션에서 참조된 프로젝트를 마이그레이션합니다. - 마이그레이션할 디렉터리. 마이그레이션할 project.json 파일을 재귀적으로 검색합니다. 지정하지 않는 경우 현재 디렉터리로 기본 설정됩니다.

# CmdTemplateDescription
source: The base MSBuild template to use for the migrated project. The default is the project included in dotnet new.
cs: Základní šablona MSBuild, která se má použít pro migrovaný projekt. Výchozí hodnotou je projekt v příkazu dotnet new.
de: Die grundlegende MSBuild-Vorlage, die für das migrierte Projekt verwendet werden soll. Standardmäßig wird das in "dotnet new" enthaltene Projekt verwendet.
es: La plantilla base de MSBuild para el proyecto migrado. El valor predeterminado es el proyecto incluido en dotnet new.
fr: Modèle MSBuild de base à utiliser pour le projet migré. La valeur par défaut est le projet inclus dans dotnet new.
ja: 移行したプロジェクトに使用する基本の MSBuild テンプレート。 既定は dotnet new に含まれるプロジェクトです。
ko: 마이그레이션된 프로젝트에 사용할 기본 MSBuild 템플릿입니다. 기본값은 새 dotnet에 포함된 프로젝트입니다.

# CmdVersionDescription
source: The version of the SDK package that will be referenced in the migrated project. The default is the version of the SDK in dotnet new.
cs: Verze balíčku sady SDK, na kterou bude odkazovat migrovaný projekt. Výchozí hodnotou je verze sady SDK v příkazu dotnet new.
de: Die Version des SDK-Pakets, auf das in dem migrierten Projekt verwiesen wird. Standardmäßig wird die Version des SDK in "dotnet new" verwendet.
es: La versión del paquete de SDK al que se hará referencia en el proyecto migrado. El valor predeterminado es la versión del SDK en dotnet new.
fr: Version du package de kit SDK à référencer dans le projet migré. La valeur par défaut est la version du kit SDK dans dotnet new.
ja: 移行したプロジェクトで参照される SDK パッケージのバージョン。 既定は dotnet new の SDK のバージョンです。
ko: 마이그레이션된 프로젝트에서 참조되는 SDK 패키지의 버전입니다. 기본값은 새 dotnet의 SDK 버전입니다.

# CmdXprojFileDescription
source: The path to the xproj file to use. Required when there is more than one xproj in a project directory.
cs: Cesta k používanému souboru xproj. Pokud je v adresáři projektu více souborů xproj., je tento údaj povinný.
de: Der Pfad zu der zu verwendenden XPROJ-Datei. Erforderlich, wenn ein Projektverzeichnis mehrere XPROJ-Dateien enthält.
es: Ruta de acceso al archivo xproj que debe usarse. Es necesario cuando hay más de un archivo xproj en un directorio de proyecto.
fr: Chemin du fichier xproj à utiliser. Obligatoire s'il existe plusieurs fichiers xproj dans un répertoire de projet.
ja: 使用する xproj ファイルへのパス。プロジェクト ディレクトリに複数の xproj がある場合に必要です。
ko: 사용할 xproj 파일의 경로입니다. 프로젝트 디렉터리에 두 개 이상의 xproj가 있는 경우 필요합니다.

# CmdSkipProjectReferencesDescription
source: Skip migrating project references. By default, project references are migrated recursively.
cs: Vynechá migraci odkazů na projekt. Odkazy na projekt se automaticky migrují rekurzivně.
de: Migration von Projektverweisen überspringen. Projektverweise werden standardmäßig rekursiv migriert.
es: Omite la migración de las referencias del proyecto. De forma predeterminada, las referencias del proyecto se migran recursivamente.
fr: Ignorez la migration des références de projet. Par défaut, les références de projet font l'objet d'une migration récursive.
ja: プロジェクト参照の移行をスキップします。既定では、プロジェクト参照は再帰的に移行されます。
ko: 프로젝트 참조 마이그레이션을 건너뜁니다. 기본적으로 프로젝트 참조가 재귀적으로 마이그레이션됩니다.

# CmdReportFileDescription
source: Output migration report to the given file in addition to the console.
cs: Generovat výstupní sestavu o migraci do určeného souboru (kromě konzoly).
de: Migrationsbericht sowohl in der Konsole als auch in die angegebene Datei ausgeben.
es: Emite el informe de migración en el archivo dado además de la consola.
fr: Envoyer le rapport de migration au fichier donné en plus de la console.
ja: コンソールに加えて、指定されたファイルに移行レポートを出力します。
ko: 마이그레이션 보고서를 콘솔 외에 지정된 파일로도 출력합니다.

# CmdReportOutputDescription
source: Output migration report file as json rather than user messages.
cs: Generovat místo uživatelských zpráv soubor se sestavou o migraci ve formátu JSON.
de: Migrationsberichtsdatei nicht als Benutzermeldungen, sondern als JSON ausgeben.
es: Emite el archivo de informe de la migración como json en lugar de mensajes al usuario.
fr: Envoyer le fichier du rapport de migration au format json (et non sous la forme de messages utilisateur).
ja: ユーザー メッセージではなく json として移行レポート ファイルを出力します。
ko: 마이그레이션 보고서 파일을 사용자 메시지가 아니라 json으로 출력합니다.

# CmdSkipBackupDescription
source: Skip moving project.json, global.json, and *.xproj to a `backup` directory after successful migration.
cs: Přeskočit po úspěšné migraci přesun souborů project.json, global.json a *.xproj do adresáře backup.
de: "project.json", "global.json" und "*.xproj" nach erfolgreicher Migration nicht in ein Sicherungsverzeichnis verschieben.
es: Omite el traslado de los archivos project.json, global.json y *.xproj a directorio "backup" después de una migración correcta.
fr: Ignorer le déplacement de project.json, global.json et *.xproj dans un répertoire 'backup' après une migration réussie.
ja: 移行が成功すると、project.json、global.json、および *.xproj の `backup` ディレクトリへの移動をスキップします。
ko: 마이그레이션을 완료한 후 project.json, global.json 및 *.xproj를 '백업' 디렉터리로 이동하는 작업을 건너뜁니다.

# MigrationFailedError
source: Migration failed.
cs: Migrace se nezdařila.
de: Fehler beim Migrieren.
es: No se pudo llevar a cabo la migración.
fr: Échec de la migration.
ja: 移行に失敗しました。
ko: 마이그레이션하지 못했습니다.

# MigrationAdditionalHelp
source: The project migration has finished. Please visit https://aka.ms/coremigration to report any issues you've encountered or ask for help.
cs: Migrace projektu je hotová. Přejděte prosím na https://aka.ms/coremigration, kde můžete nahlásit jakékoli problémy, nebo požádat o pomoc.
de: Die Projektmigration ist abgeschlossen. Unter https://aka.ms/coremigration können Sie aufgetretene Probleme melden oder Hilfe erhalten.
es: La migración del proyecto ha finalizado. Visite https://aka.ms/coremigration para notificar los problemas que haya encontrado o solicitar ayuda.
fr: La migration du projet est finie. Accédez à https://aka.ms/coremigration pour signaler les problèmes rencontrés ou pour demander de l'aide.
ja: プロジェクトの移行が完了しました。問題が発生した場合は https://aka.ms/coremigration にアクセスしてその問題を報告するか、サポートを依頼してください。
ko: 프로젝트 마이그레이션이 완료되었습니다. https://aka.ms/coremigration을 방문하여 발생한 문제를 보고하거나 지원을 요청하세요.

# MigrationReportSummary
source: Summary
cs: Shrnutí
de: Zusammenfassung
es: Resumen
fr: Récapitulatif
ja: 概要
ko: 요약

# MigrationReportTotalProjects
source: Total Projects: {0}
cs: Celkový počet projektů: {0}
de: Projekte insgesamt: {0}
es: Proyectos totales: {0}
fr: Total des projets : {0}
ja: 合計プロジェクト数: {0}
ko: 총 프로젝트: {0}

# MigrationReportSucceededProjects
source: Succeeded Projects: {0}
cs: Počet úspěšných projektů: {0}
de: Erfolgreiche Projekte: {0}
es: Proyectos correctos: {0}
fr: Projets réussis : {0}
ja: 成功したプロジェクトの数: {0}
ko: 성공한 프로젝트: {0}

# MigrationReportFailedProjects
source: Failed Projects: {0}
cs: Počet neúspěšných projektů: {0}
de: Projekte mit Fehlern: {0}
es: Proyectos erróneos: {0}
fr: Projets non réussis : {0}
ja: 失敗したプロジェクトの数: {0}
ko: 실패한 프로젝트: {0}

# ProjectMigrationSucceeded
source: Project {0} migration succeeded ({1}).
cs: Migrace projektu {0} byla úspěšná ({1}).
de: Migration von Projekt {0} erfolgreich ({1}).
es: La migración del proyecto {0} se realizó correctamente ({1}).
fr: La migration du projet {0} a réussi ({1}).
ja: プロジェクト {0} の移行に成功しました ({1})。
ko: 프로젝트 {0} 마이그레이션에 성공했습니다({1}).

# ProjectMigrationFailed
source: Project {0} migration failed ({1}).
cs: Migrace projektu {0} byla neúspěšná ({1}).
de: Fehler bei der Migration von Projekt {0} ({1}).
es: Error al migrar el proyecto {0} ({1}).
fr: Échec de la migration du projet {0} ({1}).
ja: プロジェクト {0} の移行に失敗しました ({1})。
ko: 프로젝트 {0} 마이그레이션에 실패했습니다({1}).

# MigrationFailedToFindProjectInGlobalJson
source: Unable to find any projects in global.json.
cs: V souboru global.json se nenašly žádné projekty.
de: In "global.json" wurden keine Projekte gefunden.
es: No se puede encontrar ningún proyecto en global.json.
fr: Projets introuvables dans global.json.
ja: global.json にプロジェクトが見つかりません。
ko: global.json에서 프로젝트를 찾을 수 없습니다.

# MigrationUnableToFindProjects
source: Unable to find any projects in {0}.
cs: V {0} se nenašly žádné projekty.
de: In {0} wurden keine Projekte gefunden.
es: No se puede encontrar ningún proyecto en {0}.
fr: Projets introuvables dans {0}.
ja: {0} にプロジェクトが見つかりません。
ko: {0}에서 프로젝트를 찾을 수 없습니다.

# MigrationProjectJsonNotFound
source: No project.json file found in '{0}'.
cs: V {0} se nenašel žádný soubor project.json.
de: In "{0}" wurde keine Datei vom Typ "project.json" gefunden.
es: No se encontró ningún archivo project.json en "{0}".
fr: Fichier project.json introuvable dans '{0}'.
ja: '{0}' に project.json ファイルが見つかりません。
ko: '{0}'에서 project.json 파일을 찾지 못했습니다.

# MigrationInvalidProjectArgument
source: Invalid project argument - '{0}' is not a project.json, global.json, or solution.sln file and a directory named '{0}' doesn't exist.
cs: Neplatný argument projektu – {0} není souborem project.json, global.json ani solution.sln a adresář s názvem {0} neexistuje.
de: Ungültiges Projektargument – "{0}" ist keine Datei vom Typ "project.json", "global.json" oder "solution.sln", und ein Verzeichnis mit dem Namen "{0}" ist nicht vorhanden.
es: Argumento de proyecto no válido: "{0}" no es un archivo project.json, global.json o solution.sln y no existe un directorio llamado "{0}".
fr: Argument de projet non valide - '{0}' n'est pas un fichier project.json, global.json ou solution.sln. De plus, il n'existe aucun répertoire nommé '{0}'.
ja: 無効なプロジェクト引数 - '{0}' は project.json、global.json、solution.sln ファイルではなく、'{0}' という名前のディレクトリは存在しません。
ko: 잘못된 프로젝트 인수 - '{0}'은(는) project.json, global.json 또는 solution.sln 파일이 아니며 이름이 '{0}'인 디렉터리가 존재하지 않습니다.

# MigratonUnableToFindProjectJson
source: Unable to find project.json file at {0}.
cs: V umístění {0} se nenašel soubor project.json.
de: Unter {0} wurde keine Datei vom Typ "project.json" gefunden.
es: No se puede encontrar el archivo project.json en {0}.
fr: Le fichier project.json est introuvable sur {0}.
ja: {0} に project.json ファイルが見つかりません。
ko: {0}에서 project.json 파일을 찾을 수 없습니다.

# MigrationUnableToFindGlobalJson
source: Unable to find global settings file at {0}.
cs: V umístění {0} se nenašel soubor globálního nastavení.
de: Unter {0} wurde keine globale Einstellungsdatei gefunden.
es: No se puede encontrar el archivo de configuración global en {0}.
fr: Le fichier de paramètres globaux est introuvable sur {0}.
ja: {0} にグローバル設定ファイルが見つかりません。
ko: {0}에서 전역 설정 파일을 찾을 수 없습니다.

# MigrationUnableToFindSolutionFile
source: Unable to find the solution file at {0}.
cs: V umístění {0} se nenašel soubor řešení.
de: Unter {0} wurde keine Projektmappendatei gefunden.
es: No se puede encontrar el archivo de solución en {0}.
fr: Le fichier solution est introuvable sur {0}.
ja: {0} にソリューション ファイルが見つかりません。
ko: {0}에서 솔루션 파일을 찾을 수 없습니다.

# MigrateFilesBackupLocation
source: Files backed up to {0}
cs: Soubory byly zálohovány do {0}.
de: Dateien wurden in {0} gesichert
es: Copia de seguridad de archivos en {0}
fr: Fichiers sauvegardés sur {0}
ja: {0} にバックアップされるファイル
ko: 파일이 {0}에 백업되었습니다.
