Repository: dotnet/cli
Catalog: src/dotnet/ToolManifest/xlf/LocalizableStrings.*.xlf
Languages: cs, es

# CannotFindPackageIdInManifest
source: Cannot find a package with the package id {0} in the manifest file.
cs: V souboru manifestu nejde najít balíček s ID {0}.
es: No puede encontrar un paquete con el id. de paquete {0} en el archivo de manifiesto.

# ManifestHasMarkOfTheWeb
source: File {0} came from another computer and might be blocked to help protect this computer. For more information, including how to unblock, see https://aka.ms/motw
cs: Soubor {0} pochází z jiného počítače a mohl být zablokován z důvodu ochrany tohoto počítače. Další informace včetně postupu odblokování najdete na https://aka.ms/motw.
es: El archivo {0} provenía de otro equipo y podría bloquearse para ayudar a proteger este equipo. Para más información, incluyendo cómo desbloquear, vea https://aka.ms/motw

# ManifestPackageIdCollision
source: Cannot add package. Manifest file already contains version {0} of the package {1}. Uninstall/install or edit manifest file {2} to specify the new version {3}.
cs: Balíček nejde přidat. Soubor manifestu už obsahuje verzi {0} balíčku {1}. Odinstalujte a znovu nainstalujte soubor manifestu {2} nebo ho upravte tak, aby specifikoval novou verzi {3}.
es: No se puede agregar el paquete. El archivo de manifiesto contiene la versión {0} del paquete {1}. Instale/desinstale o modifique el archivo de manifiesto {2} para especificar la nueva versión {3}.

# VersionIsInvalid
source: Version {0} is invalid.
cs: Verze {0} není platná.
es: La versión {0} no es válida.

# FieldCommandsIsMissing
source: Missing 'commands' entry.
cs: Chybí položka commands.
es: Falta la entrada "commands".

# InvalidManifestFilePrefix
source: Invalid manifest file. Path {0}: {1}
cs: Neplatný soubor manifestu. Cesta {0}: {1}
es: Archivo de manifiesto no válido. Ruta {0}: {1}

# InPackage
source: In package {0}: {1}
cs: V balíčku {0}: {1}
es: En paquete {0}: {1}

# ManifestVersionHigherThanSupported
source: Manifest version is {0}. This manifest may not be supported in this SDK version that can support up to manifest version {1}.
cs: Verze manifestu je {0}. Tento manifest nemusí být v této verzi sady SDK podporovaný. Sada podporuje manifesty do verze {1}.
es: La versión del manifiesto es {0}. Este manifiesto puede no ser compatible en esta versión del SDK que puede admitir hasta la versión del manifiesto {1}.

# ManifestVersion0
source: Manifest version 0 is not supported.
cs: Verze manifestu 0 není podporovaná.
es: La versión del manifiesto 0 no es compatible.

# ToolMissingVersion
source: Missing 'version' entry.
cs: Chybí položka version.
es: Falta entrada de "versión".

# JsonParsingError
source: Json parsing error in file {0} : {1}
cs: Chyba parsování kódu JSON v souboru {0}: {1}
es: Error de análisis de JSON en archivo {0} : {1}

# ManifestMissingIsRoot
source: Missing 'isRoot' entry.
cs: Chybí položka isRoot.
es: Falta la entrada "isRoot".
