Repository: dotnet/cli
Catalog: src/dotnet/commands/dotnet-build/xlf/LocalizableStrings.*.xlf
Languages: ko, pl, zh_hant

# AppDescription
source: Builder for the .NET Platform. Delegates to the MSBuild 'Build' target in the project file.
ko: .NET 플랫폼용 작성기입니다. 프로젝트 파일의 MSBuild '빌드' 대상에 위임합니다.
pl: Konstruktor dla platformy .NET. Deleguje do docelowego elementu kompilacji programu MSBuild w pliku projektu.
zh_hant: 適用於 .NET 平台的產生器。委派給專案檔中的 MSBuild 'Build' 目標。

# AppFullName
source: .NET Builder
ko: .NET 작성기
pl: Konstruktor platformy .NET
zh_hant: .NET 產生器

# ConfigurationOptionDescription
source: Configuration to use for building the project. Default for most projects is "Debug".
ko: 빌드할 구성입니다.
pl: Konfiguracja, przy użyciu której ma zostać przeprowadzona kompilacja
zh_hant: 作為建置依據的組態

# ConfigurationOptionName
source: CONFIGURATION
pl: KONFIGURACJA
zh_hant: 組態

# FrameworkOptionDescription
source: Target framework to build for. The target framework has to be specified in the project file.
ko: 특정 프레임워크를 컴파일합니다.
pl: Skompiluj określoną platformę
zh_hant: 編譯特定架構

# FrameworkOptionName
source: FRAMEWORK
pl: PLATFORMA
zh_hant: 架構

# NoDependenciesOptionDescription
source: Set this flag to ignore project-to-project references and only build the root project
ko: 프로젝트 간 참조를 무시하고 루트 프로젝트만 빌드하려면 이 플래그를 설정합니다.
pl: Ustaw tę flagę, aby ignorować odwołania między projektami i skompilować tylko projekt główny
zh_hant: 將此旗標設定為略過專案對專案參考並僅建置根專案

# NoIncrementialOptionDescription
source: Disables incremental build.
ko: 증분 빌드를 해제하려면 이 플래그를 설정합니다.
pl: Ustaw tę flagę, aby wyłączyć kompilację przyrostową
zh_hant: 將此旗標設定為關閉累加建置

# OutputOptionDescription
source: Output directory in which to place built artifacts.
ko: 출력을 배치할 디렉터리입니다.
pl: Katalog, w którym mają zostać umieszczone dane wyjściowe
zh_hant: 要放置輸出的目錄

# OutputOptionName
source: OUTPUT_DIR
pl: KATALOG_WYJŚCIOWY

# ProjectArgumentDescription
source: The MSBuild project file to build. If a project file is not specified, MSBuild searches the current working directory for a file that has a file extension that ends in `proj` and uses that file.
ko: 빌드할 MSBuild 프로젝트 파일입니다. 프로젝트 파일을 지정하지 않으면 MSBuild는 현재 작업 디렉터리에서 파일 확장명이 ‘proj’로 끝나는 파일을 찾아서 사용합니다.
pl: Plik projektu programu MSBuild do skompilowania. Jeśli nie określono pliku projektu, program MSBuild wyszukuje w bieżącym katalogu roboczym plik, którego rozszerzenie kończy się na „proj”, i używa tego pliku.
zh_hant: 要建置的 MSBuild 專案檔。若未指定專案檔，MSBuild 會在目前的工作目錄搜尋副檔名以 `proj` 結尾的檔案，並使用該檔案。

# ProjectArgumentValueName
source: PROJECT
pl: PROJEKT
zh_hant: 專案

# RuntimeOptionDescription
source: Target runtime to build for. The default is to build a portable application.
ko: 빌드할 대상 런타임입니다. 기본값은 이식 가능한 응용 프로그램을 빌드하는 것입니다.
pl: Docelowe środowisko uruchomieniowe kompilacji. Opcją domyślną jest kompilacja aplikacji przenośnej.
zh_hant: 要為其建置的目標執行階段。預設為建置可攜式應用程式。

# RuntimeOptionName
source: RUNTIME_IDENTIFIER
pl: IDENTYFIKATOR_ŚRODOWISKA_URUCHOMIENIOWEGO

# VersionSuffixOptionDescription
source: Defines the value for the $(VersionSuffix) property in the project
ko: 프로젝트에서 $(VersionSuffix) 속성의 값을 정의합니다.
pl: Określa wartość właściwości $(VersionSuffix) w projekcie
zh_hant: 定義專案中 $(VersionSuffix) 屬性的值

# VersionSuffixOptionName
source: VERSION_SUFFIX
pl: SUFIKS_WERSJI
