Repository: dotnet/cli
Catalog: src/dotnet/commands/dotnet-pack/xlf/LocalizableStrings.*.xlf
Languages: cs, de, es, ja, ko, pt_br, ru, tr, zh_hans, zh_hant

# AppFullName
source: .NET Core NuGet Package Packer
de: Packen
es: pack
ja: パック
ko: 팩
pt_br: empacotar
ru: упаковать
tr: pack
zh_hans: 包
zh_hant: 套件

# AppDescription
source: pack for msbuild
cs: zabalit pro msbuild
de: Für MSBuild packen
es: pack para MSBuild
ja: msbuild のパック
ko: msbuild용 팩입니다.
pt_br: empacotar para o msbuild
ru: упаковать для msbuild
tr: msbuild paketi
zh_hans: 用于 MSBuild 的包
zh_hant: MSBuild 套件

# CmdOutputDir
source: OUTPUT_DIR
es: DIRECTORIO_DE_SALIDA
pt_br: DIRETÓRIO_DE_SAÍDA
tr: ÇIKIŞ_DİZİNİ

# CmdOutputDirDescription
source: Directory in which to place built packages.
de: Verzeichnis für Ausgaben
es: Directorio donde se ponen los archivos de salida
ja: 出力を配置するディレクトリ
ko: 출력을 배치할 디렉터리입니다.
pt_br: Diretório no qual colocar as saídas
ru: Каталог для размещения выходных данных
tr: Çıkışların yerleştirileceği dizin
zh_hans: 用于放置输出的目录
zh_hant: 要放置輸出的目錄

# CmdNoBuildOptionDescription
source: Skip building the project prior to packing. By default, the project will be built.
de: Projekt nicht vor dem Packen erstellen
es: No se compila el proyecto antes de crear el paquete
ja: パックする前にプロジェクトを構築しないでください
ko: 압축하기 전에 프로젝트를 빌드하지 않습니다.
pt_br: Não compile o projeto antes de empacotar
ru: Не выполнять сборку проектов перед упаковкой
tr: Projeyi derlemeden önce paketleyin
zh_hans: 打包之前不要生成项目
zh_hant: 請勿在封裝前建置專案

# CmdIncludeSymbolsDescription
source: Include packages with symbols in addition to regular packages in output directory.
de: PDBs zusammen mit DLLs im Ausgabeordner einschließen
es: Se incluyen los archivos PDB junto con las bibliotecas DLL en la carpeta de salida
ja: 出力フォルダーに DLL と共に PDB を含める
ko: 출력 폴더에 DLL과 함께 PDB를 포함합니다.
pt_br: Incluir os PDBs juntamente com os DLLs na pasta de saída
ru: Включать PDB-файлы вместе с библиотеками DLL в выходную папку
tr: Çıkış klasörüne DLL’ler ile birlikte PDB’leri ekleyin
zh_hans: 输出文件夹中包括 PDB 和 DLL。
zh_hant: 將 PDB 和 DLL 包含在輸出資料夾中

# CmdIncludeSourceDescription
source: Include PDBs and source files. Source files go into the src folder in the resulting nuget package
cs: Zahrne soubory PDB a zdrojové soubory. Zdrojové soubory ve složce srcve výsledném balíčku NuGet
de: PDBs und Quelldateien einschließen. Quelldateien werden im Ordner "src" im resultierenden NuGet-Paket abgelegt.
es: Se incluyen los archivos PDB y de código fuente. Los archivos de código fuente van a la carpeta src del paquete NuGet resultante
ja: PDB とソース ファイルを含めます。ソース ファイルは、結果の nuget パッケージの src フォルダーに移動します
ko: PDB 및 소스 파일을 포함합니다. 소스 파일이 결과 nuget 패키지의 src 폴더로 이동합니다.
pt_br: Incluir os arquivos de origem e os PDBs. Os arquivos de origem vão para a pasta de origem no pacote nuget resultante
ru: Включение PDB-файлов и исходных файлов. Исходные файлы передаются в папку src в получившемся проекте NuGet
tr: PDB’leri ve kaynak dosyaları ekleyin. Elde edilen nuget paketinde kaynak dosyaları, src klasöründe yer alır
zh_hans: 包括 PDB 和源文件。源文件放入 nuget 结果包的 src 文件夹中
zh_hant: 包含 PDB 和來源檔案。來源檔案會傳入產生之 NuGet 套件中的 src 資料夾

# CmdConfig
source: CONFIGURATION
es: CONFIGURACIÓN
pt_br: CONFIGURAÇÃO
tr: YAPILANDIRMA
zh_hant: 組態

# CmdConfigDescription
source: Configuration to use for building the project. Default for most projects is "Debug".
de: Konfiguration für den Buildvorgang
es: Configuración para la compilación
ja: 構築する構成
ko: 빌드할 구성입니다.
pt_br: Configuração sob a qual compilar
ru: Конфигурация, в которой выполняется сборка
tr: Derlemenin gerçekleştirileceği yapılandırma
zh_hans: 在何处生成配置
zh_hant: 作為建置依據的組態

# CmdVersionSuffix
source: VERSION_SUFFIX
es: SUFIJO_DE_VERSIÓN
pt_br: SUFIXO_DA_VERSÃO
tr: SÜRÜM_SONEKİ

# CmdVersionSuffixDescription
source: Defines the value for the $(VersionSuffix) property in the project.
de: Definiert, wodurch "*" im Versionsfeld in "project.json" ersetzt werden soll.
es: Define con qué debe reemplazarse “*” en el campo de versión de project.json
ja: project.json のバージョン フィールド内で `*` を置き換えるものを定義する
ko: project.json의 버전 필드에서 `*`를 대체할 항목을 정의합니다.
pt_br: Define pelo que ‘*’ deve ser substituído no campo de versão no project.json
ru: Определяет элемент, заменяющий "*" в поле версии файла project.json
tr: Project.json dosyasındaki sürüm alanında `*` simgesinin neyle değiştirileceğini tanımlar
zh_hans: 定义 project.json 的版本字段应该替换哪个 “*”。
zh_hant: 在 project.json 的版本欄位中定義 `*` 的取代項目

# CmdServiceableDescription
source: Set the serviceable flag in the package. For more information, please see https://aka.ms/nupkgservicing.
de: Verarbeitungsflag im Paket festlegen
es: Establece la marca serviceable en el paquete
ja: パッケージに処理可能なフラグを設定する
ko: 패키지에서 서비스 가능 플래그를 설정합니다.
pt_br: Definir o sinalizador operacional no pacote
ru: Задать флаг "подлежит обслуживанию" в пакете
tr: Pakette serviceable bayrağını ayarlayın
zh_hans: 在包中设置可用标志
zh_hant: 設定套件中提供服務的旗標

# CmdArgumentProject
source: PROJECT
es: PROYECTO
pt_br: PROJETO
tr: PROJE
zh_hant: 專案

# CmdArgumentDescription
source: The project to pack, defaults to the project file in the current directory. Can be a path to any project file
cs: Balený projekt – výchozí hodnotou je soubor projektu v aktuálním adresáři. Může to být cesta k libovolnému souboru projektu.
de: Das zu packende Projekt (standardmäßig die Projektdatei im aktuellen Verzeichnis). Kann ein Pfad zu einer beliebigen Projektdatei sein.
es: Proyecto que se va a empaquetar; de forma predeterminada, toma el archivo del proyecto del directorio actual. Puede ser una ruta de acceso a cualquier archivo de proyecto
ja: パックするプロジェクト。既定は現在のディレクトリ内のプロジェクト ファイルです。任意のプロジェクト ファイルへのパスを指定できます
ko: 압축할 프로젝트입니다. 현재 디렉터리의 프로젝트 파일로 기본 설정됩니다. 프로젝트 파일의 경로일 수 있습니다.
pt_br: O projeto a ser empacotado, usa como padrão o arquivo de projeto no diretório atual. Pode ser um caminho para qualquer arquivo de projeto
ru: Упаковываемый проект; по умолчанию используется файл проекта в текущем каталоге. Может быть путем к любому файлу проекта
tr: Paketlenecek proje; varsayılan olarak, geçerli dizindeki proje dosyasıdır. Herhangi bir proje dosyasının yolu olabilir
zh_hans: 要打包的项目，默认为当前目录中的项目文件。可以是任何项目文件的路径
zh_hant: 要封裝的專案，預設為目前目錄中的專案檔。可以是任何專案檔的路徑

# AppFullName
source: pack
cs: zabalit

# CmdOutputDirDescription
source: Directory in which to place outputs
cs: Adresář pro ukládání výstupů

# CmdNoBuildOptionDescription
source: Do not build project before packing
cs: Nesestavujte projekt, dokud ho nezabalíte.

# CmdIncludeSymbolsDescription
source: Include PDBs along with the DLLs in the output folder
cs: Zahrnout do výstupní složky soubory PDB a knihovny DLL

# CmdConfigDescription
source: Configuration under which to build
cs: Konfigurace použitá k sestavení

# CmdVersionSuffixDescription
source: Defines what `*` should be replaced with in version field in project.json
cs: Definuje, čím nahradit „*“ v poli verze v souboru project.json.

# CmdServiceableDescription
source: Set the serviceable flag in the package
cs: Nastavit v balíčku příznak obsluhovatelnosti
