Repository: dotnet/cli
Catalog: src/Microsoft.DotNet.ProjectJsonMigration/xlf/LocalizableStrings.*.xlf
Languages: cs, es, fr, it, ko, zh_hans

# DoubleMigrationError
source: Detected double project migration: {0}
cs: Byla zjištěna dvojí migrace projektu: {0}
es: Se detectó una migración de proyecto doble: {0}
fr: Détection d'une migration de projet en double : {0}
it: È stata rilevata una doppia migrazione del progetto: {0}
ko: 이중 프로젝트 마이그레이션이 검색됨: {0}
zh_hans: 检测到双项目迁移: {0}

# CannotMergeMetadataError
source: Cannot merge metadata with the same name and different values
cs: Metadata se stejným názvem ale různými hodnotami nejdou sloučit.
es: No se pueden combinar metadatos con el mismo nombre y valores distintos
fr: Impossible de fusionner des métadonnées avec un nom identique et des valeurs distinctes
it: Non è possibile unire i metadati con lo stesso nome e valori diversi
ko: 동일한 이름의 값이 서로 다른 메타데이터를 병합할 수 없습니다.
zh_hans: 无法合并具有相同名称和不同值的元数据

# NoXprojFileGivenError
source: {0}: No xproj file given.
cs: {0}: Soubor xproj není zadaný.
es: {0}: no se proporcionó archivo xproj.
fr: {0} : aucun fichier xproj fourni.
it: {0}: il file xproj non è stato specificato.
ko: {0}: 지정된 xproj 파일이 없습니다.
zh_hans: {0}: 未提供 xproj 文件。

# MultipleXprojFilesError
source: Multiple xproj files found in {0}, please specify which to use
cs: V {0} bylo zjištěno několik souborů xproj. Prosím zadejte, jaký se má použít.
es: Se encontraron varios archivos xproj en {0}; especifique cuáles se usarán
fr: Plusieurs fichiers xproj trouvés dans {0}. Spécifiez celui qui doit être utilisé
it: In {0} sono stati trovati più file xproj. Specificare quello da usare
ko: {0}에 여러 xproj 파일이 있습니다. 사용할 파일을 지정하세요.
zh_hans: 在 {0} 中找到多个 xproj 文件。请指定要使用哪一个

# NullMSBuildProjectTemplateError
source: Expected non-null MSBuildProjectTemplate in MigrationSettings
cs: V nastavení MigrationSettings se v šabloně MSBuildProjectTemplate očekává jiná hodnota než null.
es: Se esperaba un valor MSBuildProjectTemplate no nulo en MigrationSettings
fr: MSBuildProjectTemplate non null attendu dans MigrationSettings
it: In MigrationSettings è previsto un elemento MSBuildProjectTemplate non Null
ko: MigrationSettings에 Null이 아닌 MSBuildProjectTemplate 필요
zh_hans: MigrationSettings 中预期使用 non-null MSBuildProjectTemplate

# CannotMigrateProjectWithCompilerError
source: Cannot migrate project {0} using compiler {1}
cs: K migraci projektu {0} se nedá použít kompilátor {1}.
es: No se puede migrar el proyecto {0} con el compilador {1}
fr: Impossible d'effectuer la migration du projet {0} à l'aide du compilateur {1}
it: Non è possibile eseguire la migrazione del progetto {0} con il compilatore {1}
ko: {1} 컴파일러를 사용하여 {0} 프로젝트를 마이그레이션할 수 없습니다.
zh_hans: 无法使用编译器 {1} 迁移项目 {0}

# ExpectedElementToBeOfTypeNotTypeError
source: Expected element to be of type {0}, but got {1}
cs: Očekávaný prvek by měl mít typ {0}, ale má {1}.
es: Se esperaba un elemento de tipo {0}, pero se recibió {1}
fr: L'élément est censé être de type {0}, au lieu de {1}
it: L'elemento doveva essere di tipo {0}, ma è stato ottenuto {1}
ko: {0} 형식의 요소가 필요하지만 {1}을(를) 받았습니다.
zh_hans: 预期元素为类型 {0}，但得到 {1}

# ProjAlreadyExistsError
source: {0} already exists. Has migration already been run?
cs: {0} už existuje. Spustili jste už migraci?
es: {0} ya existe. ¿Ya se ejecutó la migración?
fr: {0} existe déjà. La migration a-t-elle déjà été effectuée ?
it: {0} esiste già. La migrazione è già stata eseguita?
ko: {0}은(는) 이미 있습니다. 마이그레이션이 이미 실행되었나요?
zh_hans: {0} 已存在。是否已运行迁移？

# NullDestinationElementError
source: expected destinationElement to not be null
cs: Očekávaný prvek destinationElement nesmí být null.
es: Se esperaba que el valor destinationElement no fuese nulo
fr: destinationElement est censé être non null
it: l'elemento destinationElement non deve essere Null
ko: destinationElement는 null이 아니어야 함
zh_hans: 预期 destinationElement 不为 null

# DiagnosticMessageTemplate
source: {0} (line: {1}, file: {2})
cs: {0} (řádek: {1}, soubor: {2})
es: {0} (línea: {1}, archivo: {2})
fr: {0} (ligne : {1}, fichier : {2})
it: {0} (riga: {1}, file: {2})
ko: {0}(줄: {1}, 파일: {2})
zh_hans: {0} (行: {1}，文件: {2})

# CannotMergeItemsOfDifferentTypesError
source: Cannot merge items of different types.
cs: Položky různého typu se nedají sloučit.
es: No se pueden combinar elementos de tipos distintos.
fr: Impossible de fusionner des éléments dont les types sont différents.
it: Non è possibile unire elementi di tipi diversi.
ko: 서로 다른 유형의 항목을 병합할 수 없습니다.
zh_hans: 无法合并不同类型的项。

# CannotMergeItemsWithoutCommonIncludeError
source: Cannot merge items without a common include.
cs: Bez společného zahrnutí se položky nedají sloučit.
es: No se pueden combinar elementos sin una inclusión común.
fr: Impossible de fusionner des éléments sans fichier Include commun.
it: Non è possibile unire elementi senza un elemento include comune.
ko: 공통된 포함 요소가 없는 항목을 병합할 수 없습니다.
zh_hans: 无法合并没有公共包含的项目。

# PropertyTransformApplicatorWrongElementTypeError
source: Expected element to be of type {0}, but got {1}
cs: Očekávaný prvek by měl mít typ {0}, ale má {1}.
es: Se esperaba un elemento de tipo {0}, pero se recibió {1}
fr: L'élément est censé être de type {0}, au lieu de {1}
it: L'elemento doveva essere di tipo {0}, ma è stato ottenuto {1}
ko: {0} 형식의 요소가 필요하지만 {1}을(를) 받았습니다.
zh_hans: 预期元素为类型 {0}，但得到 {1}

# UnexpectedTypeError
source: Unexpected type {0}
cs: Nečekaný typ {0}
es: Tipo {0} inesperado
fr: Type inattendu {0}
it: Tipo imprevisto: {0}
ko: 예기치 않은 유형 {0}
zh_hans: 意外类型 {0}

# MIGRATE1011
source: Deprecated Project
cs: Zastaralý projekt
es: Proyecto en desuso
fr: Projet déconseillé
it: Progetto deprecato
ko: 사용되지 않는 프로젝트
zh_hans: 已弃用的项目

# MIGRATE1012
source: Project not Restored
cs: Projekt není obnovený
es: Proyecto no restaurado
fr: Projet non restauré
it: Progetto non ripristinato
ko: 프로젝트가 복원되지 않음
zh_hans: 未还原的项目

# MIGRATE1013
source: No Project
cs: Žádný projekt
es: No hay proyecto
fr: Aucun projet
it: Nessun progetto
ko: 프로젝트 없음
zh_hans: 无项目

# MIGRATE1013Arg
source: The project.json specifies no target frameworks in {0}
cs: Soubor project.json nemá v {0} specifikované cílové platformy.
es: El archivo project.json no especifica plataformas de destino en {0}
fr: Le fichier project.json ne spécifie aucun framework cible dans {0}
it: Il file project.json non specifica alcun framework di destinazione in {0}
ko: project.json이 {0}에서 대상 프레임워크를 지정하지 않습니다.
zh_hans: project.json 在 {0} 中未指定任何目标框架

# MIGRATE1014
source: Unresolved Dependency
cs: Nevyřešená závislost
es: Dependencia no resuelta
fr: Dépendance non résolue
it: Dipendenza non risolta
ko: 확인되지 않은 종속성
zh_hans: 未解析的依赖项

# MIGRATE1014Arg
source: Unresolved project dependency ({0})
cs: Nevyřešená závislost projektu ({0})
es: Dependencia de proyecto no resuelta ({0})
fr: Dépendance de projet non résolue ({0})
it: Dipendenza del progetto non risolta ({0})
ko: 확인되지 않은 프로젝트 종속성({0})
zh_hans: 未解析的项目依赖项 ({0})

# MIGRATE1015
source: File Overwrite
cs: Přepsání souboru
es: Sobrescritura de archivo
fr: Remplacement de fichier
it: Sovrascrittura file
ko: 파일 덮어쓰기
zh_hans: 文件覆盖

# MIGRATE1016
source: Unsupported Script Variable
cs: Nepodporovaná proměnná skriptu
es: Variable de script no compatible
fr: Variable de script non prise en charge
it: Variabile script non supportata
ko: 지원되지 않는 스크립트 변수
zh_hans: 不支持的脚本变量

# MIGRATE1016Arg
source: {0} is currently an unsupported script variable for project migration
cs: {0} je v současnosti nepodporovaná proměnná skriptu pro migraci projektu
es: {0} actualmente es una variable de script no compatible con la migración de proyecto
fr: {0} est une variable de script non prise en charge pour la migration de projet
it: {0} è attualmente una variabile script non supportata per la migrazione del progetto
ko: {0}은(는) 현재 프로젝트 마이그레이션에서 지원되지 않는 스크립트 변수입니다.
zh_hans: 项目迁移目前不支持 {0} 脚本变量

# MIGRATE1017
source: Multiple Xproj Files
cs: Více souborů Xproj
es: Varios archivos Xproj
fr: Plusieurs fichiers Xproj
it: Più file xproj
ko: 여러 Xproj 파일
zh_hans: 多个 Xproj 文件

# MIGRATE1018
source: Dependency Project not found
cs: Nenalezen závislý projekt.
es: No se encontró proyecto de dependencia
fr: Projet de dépendance introuvable
it: Progetto della dipendenza non trovato
ko: 종속성 프로젝트를 찾을 수 없음
zh_hans: 未找到依赖项项目

# MIGRATE1018Arg
source: Dependency project not found ({0})
cs: Nenalezen závislý projekt ({0}).
es: No se encontró proyecto de dependencia ({0})
fr: Projet de dépendance introuvable ({0})
it: Progetto della dipendenza non trovato ({0})
ko: 종속성 프로젝트를 찾을 수 없음({0})
zh_hans: 未找到依赖项项目 ({0})

# MIGRATE1019
source: Unsupported Script Event Hook
cs: Nepodporovaný hook události skriptu
es: Enlace de evento de script no compatible
fr: Crochet d'événement de script non pris en charge
it: Hook di evento script non supportato
ko: 지원되지 않는 스크립트 이벤트 후크
zh_hans: 不支持的脚本事件挂钩

# MIGRATE1019Arg
source: {0} is an unsupported script event hook for project migration
cs: {0} je nepodporovaný hook události skriptu pro migraci projektu.
es: {0} es un enlace de evento de script no compatible con la migración de proyecto
fr: {0} est un crochet d'événement de script non pris en charge pour la migration de projet
it: {0} è un hook di evento script non supportato per la migrazione del progetto
ko: {0}은(는) 현재 프로젝트 마이그레이션에서 지원되지 않는 스크립트 이벤트 후크입니다.
zh_hans: 项目迁移不支持 {0} 脚本事件挂钩

# MIGRATE20011
source: Multi-TFM
cs: Více TFM
es: Varios TFM
fr: TFM multiple
it: TFM multiplo
ko: 다중 TFM

# MIGRATE20012
source: Configuration Exclude
cs: Vyloučit konfiguraci
es: Exclusión de configuración
fr: Exclusion de configuration
it: Esclusione configurazione
ko: 구성 제외
zh_hans: 配置排除

# MIGRATE20013
source: Non-Csharp App
cs: Aplikace není v C#
es: Aplicación no de Csharp
fr: Application non Csharp
it: App non Csharp
ko: 비 Csharp 앱
zh_hans: Non-Csharp 应用

# MIGRATE20018
source: Files specified under PackOptions
cs: Soubory zadané v části PackOptions
es: Archivos especificados en PackOptions
fr: Fichiers spécifiés sous PackOptions
it: File specificati in PackOptions
ko: PackOptions에서 지정된 파일
zh_hans: PackOptions 下指定的文件

# IncludesNotEquivalent
source: {0}.{1} includes not equivalent.
cs: {0}.{1} zahrne nevyhovující.
es: {0}.{1} incluye valores no equivalentes.
fr: {0}.{1} : inclusions non équivalentes.
it: {0}.{1} include elementi non equivalenti.
ko: {0}.{1}은(는) 비동일 항목을 포함합니다.
zh_hans: {0}.{1} 包括不等同。

# ExcludesNotEquivalent
source: {0}.{1} excludes not equivalent.
cs: {0}.{1} vyloučí nevyhovující.
es: {0}.{1} excluye valores no equivalentes.
fr: {0}.{1} : exclusions non équivalentes.
it: {0}.{1} esclude elementi non equivalenti.
ko: {0}.{1}은(는) 비동일 항목을 제외합니다.
zh_hans: {0}.{1} 排除不等同。

# RemovesNotEquivalent
source: {0}.{1} removes not equivalent.
cs: {0}.{1} odebere nevyhovující.
es: {0}.{1} quita valores no equivalentes.
fr: {0}.{1} : suppressions non équivalentes.
it: {0}.{1} rimuove elementi non equivalenti.
ko: {0}.{1}은(는) 같지 않은 항목을 제거합니다.
zh_hans: {0}.{1} 删除不等同。

# MetadataDoesntExist
source: {0}.{1} metadata doesn't exist {{ {2} {3} }}
cs: {0}.{1} metadata neexistují {{ {2} {3} }}
es: {0}.\Los metadatos {1\} no existen {{ {2} {3} }}
fr: {0}.{1} : métadonnées inexistantes {{ {2} {3} }}
it: I metadati di {0}.{1} non esistono {{ {2} {3} }}
ko: {0}.{1} 메타데이터가 없습니다. {{ {2} {3} }}
zh_hans: {0}.{1}元数据不存在 {{ {2} {3} }}

# MetadataHasAnotherValue
source: {0}.{1} metadata has another value {{ {2} {3} {4} }}
cs: {0}.{1} metadata mají jinou hodnotu {{ {2} {3} {4} }}
es: {0}.\Los metadatos {1\} tienen otro valor {{ {2} {3} {4} }}
fr: {0}.{1} : métadonnées avec une autre valeur {{ {2} {3} {4} }}
it: Il valore dei metadati di {0}.{1} è diverso {{ {2} {3} {4} }}
ko: {0}.{1} 메타데이터가 또 다른 값을 가지고 있습니다. {{ {2} {3} {4} }}
zh_hans: {0}.{1} 元数据具有另外一个值 {{ {2} {3} {4} }}

# AddingMetadataToItem
source: {0}: Adding metadata to {1} item: {{ {2}, {3}, {4} }}
cs: {0}: Přidání metadat do položky {1}: {{ {2}, {3}, {4} }}
es: {0}: Agregando metadatos al elemento {1}: {{ {2}, {3}, {4} }}
fr: {0} : ajout de métadonnées à l'élément {1} : {{ {2}, {3}, {4} }}
it: {0}: aggiunta di metadati all'elemento {1}: {{ {2}, {3}, {4} }}
ko: {0}: 메타데이터를 {1} 항목에 추가: {{ {2}, {3}, {4} }}
zh_hans: {0}: 将元数据添加到 {1} 项: {{ {2}, {3}, {4} }}

# SkipMigrationAlreadyMigrated
source: {0}: Skip migrating {1}, it is already migrated.
cs: {0}: Přeskočit migraci {1}, protože už migrace proběhla.
es: {0}: Omitir la migración de {1}; ya se migró.
fr: {0} : migration de {1} ignorée, car elle a déjà été effectuée.
it: {0}: la migrazione di {1} verrà ignorata perché è già stata eseguita.
ko: {0}: {1}의 마이그레이션을 건너뜁니다. 이미 마이그레이션되었습니다.
zh_hans: {0}: 跳过迁移 {1}，已迁移该项。

# ExecutingRule
source: Executing rule: {0}
cs: Provádění pravidla: {0}
es: Ejecutando regla: {0}
fr: Règle d'exécution : {0}
it: Esecuzione della regola: {0}
ko: 규칙 실행 중: {0}
zh_hans: 执行规则: {0}

# NoConfigurationOrFrameworkFoundInProject
source: {0}: No configuration or framework build options found in project
cs: {0}: V projektu se nenašly možnosti konfigurace nebo sestavení platformy.
es: {0}: No se encontraron opciones de compilación de plataforma ni configuración en el proyecto
fr: {0} : options de build de configuration ou de framework introuvables dans le projet
it: {0}: nel progetto non sono state trovate opzioni di configurazione o creazione del framework
ko: {0}: 프로젝트에 구성 또는 프레임워크 빌드 옵션이 없음
zh_hans: {0}: 在项目中未找到任何配置或框架生成选项

# MigratingCountTargetFrameworks
source: Migrating {0} target frameworks
cs: Migrace cílových platforem {0}
es: Migrando {0} plataformas de destino
fr: Migration de {0} frameworks cibles
it: Migrazione di {0} framework di destinazione
ko: {0} 대상 프레임워크 마이그레이션 중
zh_hans: 正在迁移 {0} 目标框架

# MigratingFramework
source: Migrating framework {0}
cs: Migrace platformy {0}
es: Migrando plataforma {0}
fr: Migration du framework {0}
it: Migrazione del framework {0}
ko: {0} 프레임워크 마이그레이션 중
zh_hans: 正在迁移框架 {0}

# ImportsTransformNullFor
source: {0}: imports transform null for {1}
cs: {0}: importy transformují hodnotu null pro {1}
es: {0}: importa el valor nulo de transformación para {1}
fr: {0} : importe une valeur null de transformation pour {1}
it: {0}: importa il valore Null della trasformazione per {1}
ko: {0}: {1}용 변환 null 가져오기
zh_hans: {0}: 为 {1} 导入 transform null

# MigratingCountXprojToCsprojReferences
source: {0}: Migrating {1} xproj to csproj references
cs: {0}: Migrace {1} odkazů xproj na csproj
es: {0}: Migrando {1} referencias de xproj a csproj
fr: {0} : migration de {1} dépendances xproj vers csproj
it: {0}: migrazione di {1} riferimenti da xproj a csproj
ko: {0}: {1} xproj를 csproj 참조로 마이그레이션 중
zh_hans: {0}: 正在将 {1} xproj 迁移到 csproj 引用

# ExecutingMigrationRule
source: {0}: Executing migration rule {1}
cs: {0}: Spuštění pravidla migrace {1}
es: {0}: Ejecutando regla de migración {1}
fr: {0} : exécution de la règle de migration {1}
it: {0}: esecuzione della regola di migrazione {1}
ko: {0}: {1} 마이그레이션 규칙 실행 중
zh_hans: {0}: 执行迁移规则 {1}

# ItemTransformApplicatorHeader
source: {0}: Item {{ ItemType: {1}, Condition: {2}, Include: {3}, Exclude: {4}, Update: {5} }}
cs: {0}: Položka {{ ItemType: {1}, Condition: {2}, Include: {3}, Exclude: {4}, Update: {5} }}
fr: {0} : élément {{ ItemType : {1}, condition : {2}, inclusion : {3}, exclusion : {4}, mise à jour : {5} }}
it: {0}: elemento {{ Tipo di elemento: {1}. Condizione: {2}. Includi: {3}. Escludi: {4}. Aggiorna: {5} }}
ko: {0}: 항목 {{ 항목 형식: {1}, 조건: {2}, 포함: {3}, 제외: {4}, 업데이트: {5} }}

# ItemTransformApplicatorItemGroup
source: {0}: ItemGroup {{ Condition: {1} }}
it: {0}: ItemGroup {{ Condizione: {1} }}
ko: {0}: ItemGroup {{ 조건: {1} }}

# ItemTransformAppliatorItemCompletelyMerged
source: {0}: Item completely merged
cs: {0}: Plně sloučená položka
es: {0}: El elemento se combinó completamente
fr: {0} : élément entièrement fusionné
it: {0}: elemento completamente unito
ko: {0}: 항목이 완전히 병합됨
zh_hans: {0}: 完全合并的项

# ItemTransformApplicatorAddItemHeader
source: {0}: AddItemToItemGroup {{ ItemType: {1}, Condition: {2}, Include: {3}, Exclude: {4}, Update: {5} }}
fr: {0} : AddItemToItemGroup {{ ItemType : {1}, condition : {2}, inclusion : {3}, exclusion : {4}, mise à jour : {5} }}
it: {0}: AddItemToItemGroup {{ Tipo di elemento: {1}. Condizione: {2}. Includi: {3}. Escludi: {4}. Aggiorna: {5} }}
ko: {0}: AddItemToItemGroup {{ 항목 형식: {1}, 조건: {2}, 포함: {3}, 제외: {4}, 업데이트: {5} }}

# ItemTransformApplicatorMergingItemWithExistingItems
source: {0}: Merging Item with {1} existing items with a different condition chain.
cs: {0}: Sloučení položky se {1} stávajícími položkami s jiným řetězcem podmínky.
es: {0}: Combinando elemento con {1} elementos existentes con una cadena de condiciones distinta.
fr: {0} : fusion de l'élément avec {1} éléments existants, avec une chaîne de condition différente.
it: {0}: unione dell'elemento con {1} elementi esistenti e una catena di condizioni diversa.
ko: {0}: 항목을 조건 체인이 다른 {1}개의 기존 항목과 병합합니다.
zh_hans: {0}: 使用不同的条件链将项与 {1} 现有项合并。

# ItemTransformApplicatorEncompassedIncludes
source: {0}: encompassed includes {1}
cs: {0}: zahrnutých obsahuje {1}
es: {0}: inclusiones incluidas {1}
fr: {0} : inclusions englobées {1}
it: {0}: incluso include {1}
ko: {0}: 포함된 항목에 {1} 포함
zh_hans: {0}: 涵盖包括 {1}

# ItemTransformApplicatorRemovingItem
source: {0}: Removing Item {{ ItemType: {1}, Condition: {2}, Include: {3}, Exclude: {4} }}
cs: {0}: Odebrání položky {{ ItemType: {1}, Condition: {2}, Include: {3}, Exclude: {4} }}
es: {0}: Quitando elemento {{ ItemType: {1}, Condition: {2}, Include: {3}, Exclude: {4} }}
fr: {0} : suppression de l'élément {{ ItemType : {1}, condition : {2}, inclusion : {3}, exclusion : {4} }}
it: {0}: rimozione dell'elemento {{ Tipo di elemento: {1}. Condizione: {2}. Includi: {3}. Escludi: {4} }}
ko: {0}: 항목 제거 {{ 항목 형식: {1}, 조건: {2}, 포함: {3}, 제외: {4} }}

# ItemTransformApplicatorIgnoringItem
source: {0}: Ignoring Item {{ ItemType: {1}, Condition: {2}, Include: {3}, Exclude: {4} }}
cs: {0}: Ignorování položky {{ ItemType: {1}, Condition: {2}, Include: {3}, Exclude: {4} }}
es: {0}: Omitiendo elemento {{ ItemType: {1}, Condition: {2}, Include: {3}, Exclude: {4} }}
fr: {0} : élément ignoré {{ ItemType : {1}, condition : {2}, inclusion : {3}, exclusion : {4} }}
it: {0}: elemento ignorato {{ Tipo di elemento: {1}. Condizione: {2}. Includi: {3}. Escludi: {4} }}
ko: {0}: 항목 무시 {{ 항목 형식: {1}, 조건: {2}, 포함: {3}, 제외: {4} }}

# ItemTransformApplicatorMergingItemWithExistingItemsSameChain
source: {0}: Merging Item with {1} existing items with the same condition chain.
cs: {0}: Sloučení položky s {1} stávajícími položkami se stejným řetězcem podmínky.
es: {0}: Combinando elemento con {1} elementos existentes con la misma cadena de condiciones.
fr: {0} : fusion de l'élément avec {1} éléments existants, avec la même chaîne de condition.
it: {0}: unione dell'elemento con {1} elementi esistenti e la stessa catena di condizioni.
ko: {0}: {1}개 기존 항목이 있는 항목을 동일한 조건 체인과 병합합니다.
zh_hans: {0}: 使用相同条件链将项与 {1} 现有项合并。

# ItemTransformApplicatorAddingMergedItem
source: {0}: Adding Merged Item {{ ItemType: {1}, Condition: {2}, Include: {3}, Exclude: {4} }}
cs: {0}: Přidání sloučené položky {{ ItemType: {1}, Condition: {2}, Include: {3}, Exclude: {4} }}
es: {0}: Agregando elemento combinado {{ ItemType: {1}, Condition: {2}, Include: {3}, Exclude: {4} }}
fr: {0} : ajout de l'élément fusionné {{ ItemType : {1}, condition : {2}, inclusion : {3}, exclusion : {4} }}
it: {0}: aggiunta dell'elemento unito {{ Tipo di elemento: {1}. Condizione: {2}. Includi: {3}. Escludi: {4} }}
ko: {0}: 병합된 항목 추가 {{ 항목 형식: {1}, 조건: {2}, 포함: {3}, 제외: {4} }}

# MergingProperty
source: Merging property, output merged property
cs: Vlastnost sloučení, vlastnost sloučeného výstupu
es: Propiedad de combinación, propiedad combinada de salida
fr: Propriété de fusion, propriété fusionnée de sortie
it: Unione della proprietà. Proprietà unita di output
ko: 속성 병합 중, 병합된 속성 출력
zh_hans: 将合并属性，输出合并的属性

# IgnoringMergedProperty
source: Ignoring fully merged property
cs: Úplně se ignoruje sloučená vlastnost
es: Omitiendo propiedad completamente combinada
fr: Propriété entièrement fusionnée ignorée
it: La proprietà completamente unita verrà ignorata
ko: 완전히 병합된 속성 무시
zh_hans: 将忽略完全合并的属性

# PropertyInfo
source: {0}: {1}, {{ Name={2}, Value={3} }}
fr: {0} : {1}, {{ Nom={2}, valeur={3} }}
it: {0}: {1}, {{ Nome={2}. Valore={3} }}
ko: {0}: {1}, {{ 이름={2}, 값={3} }}
