Repository: dotnet/cli
Catalog: src/dotnet/CommandLine/xlf/LocalizableStrings.*.xlf
Languages: es, fr, ja, pl, pt_br, ru

# LastArgumentMultiValueError
source: The last argument '{0}' accepts multiple values. No more argument can be added.
es: El último argumento "{0}" acepta varios valores. No se pueden agregar más argumentos.
fr: Le dernier argument '{0}' accepte plusieurs valeurs. Impossible d'ajouter des arguments supplémentaires.
ja: 最後の引数 '{0}' は複数の値を受け入れます。さらに引数を追加することはできません。
pl: Ostatni argument „{0}” przyjmuje wiele wartości. Nie można dodać kolejnych argumentów.
pt_br: O último argumento '{0}' aceita vários valores. Nenhum outro argumento pode ser adicionado.
ru: Последний аргумент "{0}" принимает несколько значений. Добавить дополнительные аргументы нельзя.

# UnexpectedValueForOptionError
source: Unexpected value '{0}' for option '{1}'
es: Valor inesperado "{0}" para la opción "{1}"
fr: Valeur inattendue '{0}' pour l'option '{1}'
ja: オプション '{1}' の予期しない値 '{0}'
pl: Nieoczekiwana wartość „{0}” dla opcji „{1}”
pt_br: Valor '{0}' inesperado para a opção '{1}'
ru: Непредвиденное значение "{0}" для параметра "{1}"

# UnexpectedArgumentError
source: Unrecognized {0} '{1}'
es: No se reconoció {0} "{1}"
fr: {0} non reconnu : '{1}'
ja: 認識できない {0} '{1}'
pl: Nierozpoznany element {0} „{1}”
pt_br: {0} não reconhecido '{1}'
ru: Нераспознанное значение {0} "{1}"

# ResponseFileNotFoundError
source: Response file '{0}' doesn't exist.
es: El archivo de respuesta "{0}" no existe.
fr: Le fichier réponse '{0}' n'existe pas.
ja: 応答ファイル '{0}' は存在しません。
pl: Plik odpowiedzi „{0}” nie istnieje.
pt_br: O arquivo de resposta '{0}' não existe.
ru: Файл ответов "{0}" не существует.

# ShowHelpInfo
source: Show command line help.
es: Muestra ayuda de la línea de comandos.
fr: Affichez l'aide de la ligne de commande.
ja: コマンド ラインのヘルプを表示します。
pl: Pokaż pomoc wiersza polecenia.
pt_br: Mostrar a ajuda da linha de comando.
ru: Показать справку командной строки.

# ShowVersionInfo
source: Show version information
es: Mostrar información de versión
fr: Afficher les informations de version
ja: バージョン情報を表示する
pl: Wyświetl informacje o wersji
pt_br: Mostrar informações de versão
ru: Показать информацию о версии

# ShowHintInfo
source: Specify --{0} for a list of available options and commands.
es: Especifique --{0} para obtener una lista de las opciones y los comandos disponibles.
fr: Spécifiez --{0} pour obtenir la liste des options et commandes disponibles.
ja: 利用可能なオプションとコマンドの一覧に対して --{0} を指定します。
pl: Podaj opcję --{0}, aby uzyskać listę dostępnych opcji i poleceń.
pt_br: Especifique --{0} para obter uma lista das opções e comandos disponíveis.
ru: Укажите --{0} для вывода списка доступных параметров и команд.

# UsageHeader
source: Usage:
es: Uso:
fr: Utilisation :
ja: 使用法:
pl: Użycie:
pt_br: Uso:
ru: Использование:

# UsageArgumentsToken
source: [arguments]
es: [argumentos]
pl: [argumenty]
ru: [аргументы]

# UsageArgumentsHeader
source: Arguments:
es: Argumentos:
ja: 引数:
pl: Argumenty:
pt_br: Argumentos:
ru: Аргументы:

# UsageOptionsToken
source: [options]
es: [opciones]
pl: [opcje]
ru: [параметры]

# UsageOptionsHeader
source: Options:
es: Opciones:
ja: オプション:
pl: Opcje:
pt_br: Opções:
ru: Параметры:

# UsageCommandToken
source: [command]
es: [comando]
fr: [commande]
pl: [polecenie]
ru: [команда]

# UsageCommandsHeader
source: Commands:
es: Comandos:
fr: Commandes :
ja: コマンド:
pl: Polecenia:
pt_br: Comandos:
ru: Команды:

# UsageCommandsDetailHelp
source: Use "{0} [command] --help" for more information about a command.
es: Use "{0} [comando] --help" para más información sobre un comando.
fr: Utilisez "{0} [commande] --help" pour plus d'informations sur une commande.
ja: コマンドに関する詳細情報については、"{0} [command] --help" を使用します。
pl: Użyj polecenia „{0} [polecenie] --help”, aby uzyskać więcej informacji o danym poleceniu.
pt_br: Use "{0} [command] --help" para obter mais informações sobre um comando.
ru: Используйте синтаксис "{0} [команда] --help" для получения дополнительной информации о команде.

# UsageCommandArgs
source: [args]
pl: [argumenty]
ru: [аргументы]

# UsageCommandAdditionalArgs
source: [[--] <additional arguments>...]]
es: [[--] <argumentos adicionales>...]]
fr: [[--] <arguments supplémentaires>...]]
pl: [[--] <dodatkowe argumenty>...]]
ru: [[--] <дополнительные аргументы>...]]

# UsageCommandsAdditionalArgsHeader
source: Additional Arguments:
es: Argumentos adicionales:
fr: Arguments supplémentaires :
ja: 追加引数:
pl: Dodatkowe argumenty:
pt_br: Argumentos adicionais:
ru: Дополнительные аргументы:

# InvalidTemplateError
source: Invalid template pattern '{0}'
es: Patrón de plantilla no válido "{0}"
fr: Modèle non valide '{0}'
ja: 無効なテンプレート パターン '{0}'
pl: Nieprawidłowy wzorzec szablonu „{0}”
pt_br: Padrão de modelo '{0}' inválido
ru: Недопустимая схема шаблона "{0}"

# MSBuildAdditionalArgsHelpText
source: Any extra options that should be passed to MSBuild. See 'dotnet msbuild -h' for available options.
es: Toda opción adicional que se debe pasar a MSBuild. Consulte "dotnet msbuild -h" para ver las opciones disponibles.
fr: Options supplémentaires à passer à MSBuild. Consultez 'dotnet msbuild -h' pour connaître les options disponibles.
ja: MSBuild に渡す必要があるすべての追加オプション。利用可能なオプションについては、'dotnet msbuild -h' をご覧ください。
pl: Dodatkowe opcje, które mają zostać przekazane programowi MSBuild. Uruchom polecenie „dotnet msbuild -h”, aby zapoznać się z dostępnymi opcjami.
pt_br: As opções extras que devem ser passadas para o MSBuild. Consulte 'dotnet msbuild -h' para obter as opções disponíveis.
ru: Все дополнительные параметры, которые следует передать в MSBuild. Для получения сведений о доступных параметрах см. "dotnet msbuild -h".

# OptionRequiresSingleValueWhichIsMissing
source: Required value for option '{0}' was not provided.
es: No se ha proporcionado el valor requerido para la opción "{0}".
fr: La valeur nécessaire pour l'option '{0}' n'a pas été fournie.
ja: オプション '{0}' に必要な値が指定されませんでした。
pl: Nie podano wymaganej wartości dla opcji „{0}”.
pt_br: Um valor obrigatório para a opção '{0}' não foi fornecido.
ru: Не указано обязательное значение параметра "{0}".

# CommandAcceptsOnlyOneArgument
source: Command '{0}' only accepts a single argument but {1} were provided.
es: El comando "{0}" solo acepta un argumento, pero se proporcionaron {1}.
fr: La commande '{0}' n'accepte qu'un seul argument mais {1} d'entre eux ont été fournis.
ja: コマンド '{0}' は 1 つの引数のみを受け入れますが、{1} が指定されました。
pl: Polecenie „{0}” przyjmuje tylko jeden argument, a podano {1}.
pt_br: O comando '{0}' aceita somente um único argumento, mas {1} foram fornecidos.
ru: Команда "{0}" принимает только один аргумент, но указано несколько аргументов: {1}.

# CommandAcceptsOnlyOneSubcommand
source: Command '{0}' only accepts a single subcommand but multiple were provided: {1}
es: El comando "{0}" solo acepta un subcomando, pero se proporcionaron varios: {1}.
fr: La commande '{0}' n'accepte qu'une seule sous-commande mais plusieurs d'entre elles ont été fournies : {1}
ja: コマンド '{0}' は 1 つのサブコマンドのみを受け入れますが、複数指定されました: {1}
pl: Polecenie „{0}” przyjmuje tylko jedno polecenie podrzędne, a podano ich wiele: {1}.
pt_br: O comando '{0}' aceita somente um único subcomando, mas vários foram fornecidos: {1}
ru: Команда "{0}" принимает только одну подкоманду, но указано несколько подкоманд: {1}.

# FileDoesNotExist
source: File does not exist: {0}
es: El archivo no existe: {0}
fr: Le fichier n'existe pas : {0}
ja: ファイルが存在しません: {0}
pl: Plik nie istnieje: {0}
pt_br: O arquivo não existe: {0}
ru: Файл не существует: {0}

# NoArgumentsAllowed
source: Arguments not allowed for option: {0}
es: No se permiten argumentos para la opción: {0}
fr: Arguments non autorisés pour l'option : {0}
ja: 引数をオプションで使用できません: {0}
pl: Dla tej opcji nie są dozwolone argumenty: {0}
pt_br: Argumentos não permitidos para a opção: {0}
ru: Аргументы для параметра не допускаются: {0}

# OptionAcceptsOnlyOneArgument
source: Option '{0}' only accepts a single argument but {1} were provided.
es: La opción "{0}" solo acepta un argumento, pero se proporcionaron {1}.
fr: L'option '{0}' n'accepte qu'un seul argument mais {1} d'entre eux ont été fournis.
ja: オプション '{0}' は 1 つの引数のみを受け入れますが、{1} 個指定されました。
pl: Opcja „{0}” przyjmuje tylko jeden argument, a podano {1}.
pt_br: A opção '{0}' aceita somente um único argumento, mas {1} foram fornecidos.
ru: Параметр "{0}" принимает только один аргумент, но указано несколько аргументов: {1}.

# RequiredArgumentMissingForCommand
source: Required argument missing for command: {0}
es: Falta un argumento necesario para el comando: {0}
fr: Argument obligatoire manquant pour la commande : {0}
ja: 必要な引数がコマンドにありません: {0}
pl: Brakuje argumentu wymaganego polecenia: {0}
pt_br: Argumento obrigatório ausente para o comando: {0}
ru: Отсутствует обязательный аргумент для команды: {0}

# RequiredArgumentMissingForOption
source: Required argument missing for option: {0}
es: Falta un argumento necesario para la opción: {0}
fr: Argument obligatoire manquant pour l'option : {0}
ja: 必要な引数がオプションにありません: {0}
pl: Brakuje argumentu wymaganego opcji: {0}
pt_br: Argumento obrigatório ausente para a opção: {0}
ru: Отсутствует обязательный аргумент для параметра: {0}

source: Required command was not provided.
es: No se proporcionó el comando requerido.
fr: La commande nécessaire n'a pas été fournie.
ja: 必要なコマンドが指定されませんでした。
pl: Nie podano wymaganego polecenia.
pt_br: O comando necessário não foi fornecido.
ru: Обязательная команда не указана.

# UnrecognizedArgument
source: Argument '{0}' not recognized. Must be one of: {1}
es: No se reconoce el argumento "{0}". Debe ser uno de: {1}
fr: Argument '{0}' non reconnu. Il doit faire partie de : {1}
ja: 引数 '{0}' は認識されません。次のいずれかである必要があります: {1}
pl: Nie rozpoznano argumentu „{0}”. Musi on być jednym z tych: {1}
pt_br: Argumento '{0}' não reconhecido. Ele deve ser um dos seguintes: {1}
ru: Аргумент "{0}" не распознан. Он должен быть одним из следующих: {1}

# UnrecognizedCommandOrArgument
source: Unrecognized command or argument '{0}'
es: No se reconoce el comando o el argumento "{0}"
fr: Commande ou argument non reconnu : '{0}'
ja: 認識されないコマンドまたは引数 '{0}'
pl: Nierozpoznane polecenie lub argument „{0}”
pt_br: Comando ou argumento '{0}' não reconhecido
ru: Нераспознанная команда или аргумент "{0}"

# UnrecognizedOption
source: Option '{0}' not recognized. Must be one of: {1}
es: No se reconoce la opción "{0}". Debe ser una de: {1}
fr: Option '{0}' non reconnue. Elle doit faire partie de : {1}
ja: オプション '{0}' は認識されません。次のいずれかである必要があります: {1}
pl: Nie rozpoznano opcji „{0}”. Musi ona być jedną z tych: {1}
pt_br: Opção '{0}' não reconhecida. Ela deve ser uma das seguintes: {1}
ru: Параметр "{0}" не распознан. Он должен быть одним из следующих: {1}
